[
  {
    "image": "https://storageaccountcooki9762.blob.core.windows.net/recipe-images/three-cup-chicken.jfif",
    "recipeName": "Three Cup Chicken",
    "description": "A deliciously pungent classic Taiwan dish. The three cups refer to one each of sesame oil, rice wine, and soy sauce. Make it at home quickly with this easy-to-follow recipe.",
    "ingredients": "1 kg (2.2 Ib) chicken, chopped into bite-size chunks|1 tablespoons vegetable oil|15 cloves garlic, crushed|15 slices ginger|1/3 cup sesame oil|1/3 cup Taiwan rice wine|1/3 cup soy sauce|2 chilli peppers, roughly chopped|1 tablespoon sugar|A few stalks fresh oriental basil",
    "rating": 5,
    "instructions": "In a clay pot or casserole dish, brown chicken in vegetable oil.|Add garlic and ginger and fry for a couple of minutes.|Mix sesame oil, rice wine, soy sauce, chillies and sugar, add to pot. Bring to a boil.|Cover and simmer for 15 minutes. Place basil on top of chicken, cook for a further 5 minutes.|Remove chicken, minus liquid, to a serving dish. Serve with white rice.",
    "notes": "Don’t be tempted to skimp on seasonings–this dish is meant to pack a punch. And don’t simmer much longer than 20 minutes or the chicken will start to resemble salty hunks of leather."
  },
  {
    "image": "https://storageaccountcooki9762.blob.core.windows.net/recipe-images/tea-eggs.jfif",
    "recipeName": "Tea Eggs",
    "description": "Flavoured with tea and spices, this cheap, filling snack food is found all over China. In spite of the name, tea is not the dominant flavour.",
    "ingredients": "6 eggs|3 tablespoons soy sauce|1 teaspoon salt|1 tablespoon black tea leaves or 1 tea bag|4 pieces star anise|1 small stick cinnamon or cassia bark|1 teaspoon cracked peppercorns (optional)|2 strips dried mandarin peel (optional)",
    "rating": 5,
    "instructions": "Place unshelled eggs in saucepan of cold water – water level should be at least 4 cm (1-1/2″) higher than eggs. Bring to a boil, then simmer for 2 minutes.|Remove the eggs. With a knife, tap each egg to slightly crack the shells in two or three places. Return to saucepan.|Add other ingredients and stir. Cover and simmer for 2 hours, adding water as necessary. Drain, serve hot or cold.",
    "notes": "Cook longer for a stronger flavour and a deeper colour. Tea eggs are also known as Chinese marbled eggs for the unique marbling effect on the surface of the egg. Sauce can be frozen and reused."
  },
  {
    "image": "https://storageaccountcooki9762.blob.core.windows.net/recipe-images/spring-onion-flatbread.jfif",
    "recipeName": "Spring Onion Flatbread",
    "description": "This delicious spring onion flatbread is sold all over China. Make it at home with these easy-to-follow instructions. Eat as a snack or as part of a meal. Also known as scallion pancake.",
    "ingredients": "2 cups plain (all-purpose) flour|1 cup warm water|Vegetable oil|1 cup spring onions|Salt|White pepper",
    "rating": 5,
    "instructions": "Sift flour into a mixing bowl. Add water gradually and mix until blended together.|On a floured surface, knead into a smooth, elastic dough.|Roll into a ball. Cover with a damp cloth and let sit for 30 minutes.|Separate dough into 2 pieces. Roll into balls.|On a floured surface, roll out dough thinly (2 mm).|Daub some oil over surface of each piece of rolled dough.|Spread spring onions evenly over dough.|Sprinkle salt, and add a pinch of pepper.|Roll dough tightly like a burrito.|From end to end, roll each loop into a spiral like a snail shell. Tuck tail end on top of spiral.|Roll into a disc about the size of a dinner plate.|Add 1 to 2 tablespoons of oil to a flat-bottomed frypan, bring to a medium heat, and fry on both sides until golden brown.|Slice like a pizza and serve immediately with or without a dipping sauce, or with other Chinese dishes, in place of rice or noodles.",
    "notes": "This dish is often mistakenly called a pancake but is actually unleavened bread–pancakes are made from batter. If it’s not salty enough, add some more after cooking. Oily food like this does not keep well so try to eat in one sitting, if not, best method of reheating is toasting. "
  },
  {
    "image": "https://storageaccountcooki9762.blob.core.windows.net/recipe-images/kungpao-chicken.jfif",
    "recipeName": "Kung Pao Chicken",
    "description": "Spicy chicken with peanuts, similar to what is served in Chinese restaurants. It is easy to make, and you can be as sloppy with the measurements as you want. They reduce to a nice, thick sauce. Substitute cashews for peanuts, or bamboo shoots for the water chestnuts. You can't go wrong! Enjoy!",
    "ingredients": "1 pound skinless, boneless chicken breast halves - cut into chunks|2 tablespoons white wine|2 tablespoons soy sauce|2 tablespoons sesame oil, divided|2 tablespoons cornstarch, dissolved in 2 tablespoons water|1 ounce hot chile paste|1 teaspoon distilled white vinegar|2 teaspoons brown sugar|4 green onions, chopped|1 tablespoon chopped garlic|1 (8 ounce) can water chestnuts|4 ounces chopped peanuts",
    "rating": 5,
    "instructions": "To Make Marinade: Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil and 1 tablespoon cornstarch/water mixture and mix together. Place chicken pieces in a glass dish or bowl and add marinade. Toss to coat. Cover dish and place in refrigerator for about 30 minutes.|To Make Sauce: In a small bowl combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil, 1 tablespoon cornstarch/water mixture, chili paste, vinegar and sugar. Mix together and add green onion, garlic, water chestnuts and peanuts. In a medium skillet, heat sauce slowly until aromatic.|Meanwhile, remove chicken from marinade and saute in a large skillet until meat is white and juices run clear. When sauce is aromatic, add sauteed chicken to it and let simmer together until sauce thickens.",
    "notes": "The nutrition data for this recipe includes information for the full amount of the marinade ingredients. Depending on marinating time, ingredients, cooking method, etc., the actual amount of the marinade consumed will vary."
  },
  {
    "image": "https://storageaccountcooki9762.blob.core.windows.net/recipe-images/cucumber-salad.jfif",
    "recipeName": "Cucumber Salad",
    "description": "A lightly pickled cucumber salad commonly served in Taiwan as a zesty appetiser. This is a simple dish but it needs to be prepared half a day in advance.",
    "ingredients": "3 oriental cucumbers|1/2 medium-sized carrot|2 tablespoons white rice vinegar|3 cloves garlic, finely diced|1 cayenne chilli pepper, sliced|3 teaspoons salt|1 teaspoon sugar",
    "rating": 5,
    "instructions": "Scrub cucumber and rinse skin well (do not peel).|Cut cucumbers lengthways into quarters. Cut crossways into finger-length pieces.|Slice carrot into matchstick-sized slivers.|Sprinkle 2 teaspoons of salt over cucumbers and carrot. Mix in.|Refrigerate for 1 hour.|Rinse off salt and drain.|Add remaining teaspoon of salt, rice vinegar, garlic, chilli pepper, sugar. Mix well.|Refrigerate for a further 3 hours, mix and serve.",
    "notes": "For a variation, add a teaspoon of finely diced young ginger. You can substitute the cucumber with another vegetable such as radish, kohlrabi, cabbage or Chinese cabbage. "
  },
  {
    "image": "https://storageaccountcooki9762.blob.core.windows.net/recipe-images/pepper-steak-stirfry.jfif",
    "recipeName": "Pepper Steak Stir-Fry",
    "description": "This pepper steak can serve up to 4 people and this recipe combined with vegetables provides all the protein you need.",
    "ingredients": "1 1/4 to 1 1/2 pounds sirloin steak|1 cup mushrooms (sliced)|2 bell peppers (use different color peppers to make this dish look more interesting and colorful)|1 medium onion (chopped)|1 garlic clove (smashed, peeled and chopped in half)|1 14-ounce can baby corn or fresh baby corn|1/4 cup light soy sauce|3/4 cup beef broth|1 tablespoon cornstarch|1 1/2 tablespoons water|2 tablespoons oil or margarine (for frying)|2 teaspoons sugar|1 cup tomatoes (stewed)|Salt and ground pepper, to taste",
    "rating": 5,
    "instructions": "Partially freeze the steak for 15 to 20 minutes (this will make it easier to cut). Cut the steak into thin strips.|Wipe the mushrooms with a damp cloth and cut into slices to make 1 cup.|Remove the stems and seeds from the bell peppers and cut into thin strips.|Peel and chop the onion and garlic clove.|Drain the can of baby corn and soak in cold water for 15-20 minutes then rinse under cold water. If you use fresh baby corn then just wash with cold water and drain.|Combine the soy sauce with the beef broth. Set aside.|Combine the cornstarch with the water and set aside.|Heat up 2 tablespoons of oil or margarine a large skillet or frying pan with medium-high heat. Brown the meat, turning over once.|Turn the heat down to medium. Push the meat to the side and add the onion and garlic to the frying pan.|Add the mushrooms and the baby corn. Cook for 1 minute.|Add the soy sauce and beef broth. Stir in the sugar. Bring to a boil, then reduce the heat, cover and simmer until the meat is tender (this will take around 25 to 30 minutes).|Add the peppers and stewed tomatoes. Cover and cook for another 5 to 10 minutes.|Bring to a boil and stir in the cornstarch and water mixture. Cook, stirring constantly for 4 to 5 minutes until the food is thick and bubbling. Taste and add salt and pepper if desired. Serve over cooked rice.",
    "notes": "For this recipe, you can use any kind of colored bell pepper. You can also use sirloin, rump, fillet or any other kind of steak you want."
  }
]
