[
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/eggtarts.jpg",
    "recipeName": "Egg Tarts",
    "description": "Very easy to make Chinese style Egg Tart, you can put the leftovers in the refrigerator for later use for up to 3 days.",
    "ingredients": "1 cup confectioners' sugar|3 cups all-purpose flour|1 cup butter|1 egg, beaten|1 dash vanilla extract|2/3 cup white sugar|1 1/2 cups water|9 eggs, beaten|1 dash vanilla extract|1 cup evaporated milk",
    "rating": 5,
    "instructions": "In a medium bowl, mix together the confectioners' sugar and flour. Mix in butter with a fork until it is in small crumbs. Stir in the egg and vanilla until the mixture forms a dough. The texture should be slightly moist. Add more butter if it is too dry, or more flour, if the dough seems greasy. Shape dough into 1 1/2 inch balls, and press the balls into tart molds so that it covers the bottom, and goes up higher than the sides. Use 2 fingers to shape the edge into an A shape.|Preheat the oven to 450 degrees F (230 degrees C). Combine the white sugar and water in a medium saucepan, and bring to a boil. Cook until the sugar is dissolved, remove from heat and cool to room temperature. Strain the eggs through a sieve, and whisk into the sugar mixture. Stir in the evaporated milk and vanilla. Strain the filling through a sieve, and fill the tart shells.|Bake for 15 to 20 minutes in the preheated oven, until golden brown, and the filling is puffed up a little bit.",
    "notes": "Whole milk will work as a substitute for evaporated milk."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/eggplant.jpg",
    "recipeName": "Eggplant with Garlic Sauce",
    "description": "A mildly spicy (or very spicy if you like) eggplant dish.",
    "ingredients": "3 tablespoons canola oil|4 Chinese eggplants, halved lengthwise and cut into 1 inch half moons|1 cup water|1 tablespoon crushed red pepper flakes|3 tablespoons garlic powder|5 teaspoons white sugar|1 teaspoon cornstarch|2 tablespoons light soy sauce|2 tablespoons oyster sauce",
    "rating": 5,
    "instructions": "Heat the canola oil in a skillet over high heat. Cook and stir the eggplant until soft, about 4 minutes. Stir in the water, red pepper flakes, and garlic powder. Cover and simmer until all the water is absorbed. Meanwhile, mix sugar, cornstarch, soy sauce, and oyster sauce in a bowl until sugar and cornstarch have dissolved. Stir sauce into the eggplant, making sure to evenly coat the eggplant. Cook until the sauce has thickened.",
    "notes": "Eggplants may reduce the risk of heart disease and promote healthy blood sugar control!"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/fortune_cookie.jpg",
    "recipeName": "Fortune Cookies",
    "description": "A crisp and sugary cookie usually made from flour, sugar, vanilla, and sesame seed oil with a piece of paper (fortune) inside.",
    "ingredients": "1 egg white|1/8 teaspoon vanilla extract|1 pinch salt|1/4 cup unbleached all-purpose flour|1/4 cup white sugar",
    "rating": 5,
    "instructions": "Preheat oven to 400 degrees F. Butter a cookie sheet. Write fortunes on strips of paper about 4 inches long and 1/2 inch wide. Generously grease 2 cookie sheets.|Mix the egg white and vanilla until foamy but not stiff. Sift the flour, salt, and sugar and blend into the egg white mixture.|Place teaspoonfuls of the batter at least 4 inches apart on one of the prepared cookie sheets. Tilt the sheet to move the batter into round shapes about 3 inches in diameter. Be careful to make batter as round and even as possible. Do not make too many, because the cookie have to be really hot to form them and once they cool it is too late. Start with 2 or 3 to a sheet and see how many you can do.|Bake for 5 minutes or until cookie has turned a golden color 1/2 inch wide around the outer edge of the circle. The center will remain pale. While one sheet is baking, prepare the other.|Remove from oven and quickly move cookie with a wide spatula and place upside down on a wooden board. Quickly place the fortune on the cookie, close to the middle and fold the cookie in half. Place the folded edge across the rim of a measuring cup and pull the pointed edges down, one on the inside of the cup and one on the outside. Place folded cookies into the cups of a muffin tin or egg carton to hold their shape until firm.",
    "notes": "You can now write your own fortunes and place them in cookies!"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/sesame_balls.jpg",
    "recipeName": "Sesame Balls",
    "description": "A crispy snack that is made with a sticky rice flour dough, filled with a sweet paste, rolled in sesame seeds, and fried until crispy on the outside, but still soft and chewy on the inside.",
    "ingredients": "2 1/2 slabs brown candy (_peen tong),_chopped|3 cups glutinous rice flour|1 cup Sweetened Red Bean Paste , store-bought or homemade|1/3 cup white sesame seeds|2 quarts vegetable oil",
    "rating": 5,
    "instructions": "Dissolve the brown candy in 1 cup of boiling water and set aside to cool overnight.|Place the rice flour in a large bowl. Make a well and add candy water all at once. Stir until the water is incorporated; the dough will be smooth but slightly sticky.|Dust hands lightly with rice flour and roll dough into a thick rope. Cut the rope into 24 equal pieces, roll each piece into a ball and flatten to make a 2 1/2-inch round.|Using the thumbs and index fingers from both hands, pleat the edge of the dough to form a cup. Place one index finger into the cup and gently press the dough into the opposite palm on all sides of the cup to create a smooth, even surface and to make the dough even thinner.|Add a scant 1 teaspoon of the red bean paste mixture. Gently pack the filling down. Gather the edges of the dough over the filling and, again, pleat until the hole is about 1/2 inch in diameter. Squeeze together the dough, pressing to seal the dough securely. Roll between palms to form a ball. Continue filling the remainder of the dough. Place a sheet of waxed paper on the counter and sprinkle with the sesame seeds. Roll and press the outside of each ball in the sesame seeds.|In a 8-inch wide, 5-inch deep pot, heat vegetable oil over medium-high heat until hot but not smoking, about 330 degrees on a deep-fat thermometer. Carefully add 6 sesame balls at a time, and cook over medium heat until golden, 6 to 7 minutes. As the balls float to the surface, begin to press them gently with the back of a metal spatula against the sides of the pot. The balls will expand as they are gently rotated and pressed. Increase the heat to medium-high and fry until golden brown, about 2 minutes. Place on a plate lined with several thicknesses of paper towels. Repeat with remaining sesame balls. Set aside oil to cool before discarding. Serve immediately.",
    "notes": "The Sweetened Red Bean Paste for the filling can be purchased in a can or homemade. Sesame Balls must be eaten the day they are made. The following day, they can be heated in a 300-degree oven but they are not nearly as good as when they are fresh."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/steamed_buns.jpg",
    "recipeName": "Steamed Buns",
    "description": "Also known as 'mantou' or bao buns (baozi), these tasty buns are smooth yet fluffy and usually eaten as they are or used to complement another dish.",
    "ingredients": "1 tablespoon active dry yeast|1 teaspoon white sugar|1/4 cup all-purpose flour|1/4 cup water|1/4 cup warm water|1 1/2 cups all-purpose flour|1/4 teaspoon salt|2 tablespoons white sugar|1 tablespoon vegetable oil|1/2 teaspoon baking powder",
    "rating": 5,
    "instructions": "Mix together yeast, 1 teaspoon sugar, 1/4 cup flour, and 1/4 cup warm water. Allow to stand for 30 minutes.|Mix in 1/2 cup warm water, flour, salt, 2 tablespoons sugar, and vegetable oil. Knead until dough surface is smooth and elastic. Roll over in a greased bowl, and let stand until triple in size, about 2 1/2 to 3 hours.|Punch down dough, and spread out on a floured board. Sprinkle baking powder evenly on surface, and knead for 5 minutes. Divide dough into 2 parts, and place the piece you are not working with in a covered bowl. Divide each half into 12 parts. Shape each part into a ball with smooth surface up. Put each ball on a wax paper square. Let stand covered until double, about 30 minutes.|Bring water to a boil in wok, and reduce heat to medium; the water should still be boiling. Place steam-plate on a small wire rack in the middle of the wok. Transfer as many buns on wax paper as will comfortably fit onto steam-plate leaving 1 to 2 inches between the buns. At least 2 inches space should be left between steam-plate and the wok. Cover wok with lid. Steam buns over boiling water for 15 minutes.|REMOVE LID BEFORE you turn off heat, or else water will drip back onto bun surface and produce yellowish \"blisters\" on bun surfaces. Continue steaming batches of buns until all are cooked.",
    "notes": "You can make them either plain without meat fillings, or with meat fillings!"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/spicy_green_beans.jpg",
    "recipeName": "Spicy Szechuan Green Beans",
    "description": "A hot and spicy dish from the Szechuan province.",
    "ingredients": "1/2 pound green beans, trimmed and cut into 1-inch pieces|1/4 cup water|1 tablespoon minced ginger|2 cloves garlic, minced|1 teaspoon sesame oil|2 tablespoons soy sauce|1 tablespoon rice vinegar|1/2 teaspoon white sugar|1/4 teaspoon red pepper flakes",
    "rating": 5,
    "instructions": "Combine green beans and water in a skillet over medium-high heat. Cover and cook, stirring occasionally, until beans are tender crisp, 4 to 5 minutes. Add ginger, garlic, and sesame oil; cook, stirring frequently, until garlic is lightly browned, 1 to 2 minutes.|Mix soy sauce, rice vinegar, sugar, and red pepper flakes together in a small bowl. Pour over beans and cook until sauce thickens enough to coat beans, 3 to 5 minutes.",
    "notes": "This dish tastes wonderful with ham and a baked yam."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chicken_brocolli.jpg",
    "recipeName": "Sesame Chicken with Broccoli",
    "description": "This stir-fried sesame chicken with broccoli has the classic, sweet, slightly spicy flavor you expect, but is also loaded with fresh broccoli florets. Serve with white or brown rice, or your favorite Asian noodles.",
    "ingredients": "1 1/2 pounds boneless skinless chicken breast, cut into 1-inch pieces|2 teaspoons cornstarch|1 teaspoon salt, or to taste|1/4 teaspoon white pepper, or to taste|2 teaspoons minced fresh garlic|2 teaspoons minced fresh ginger|1/4 cup plus 1 teaspoon cooking oil of choice, divided|1/3 cup soy sauce|1/3 cup hoisin sauce|1/3 cup rice vinegar|1 teaspoon sambal oelek, or to taste|2 tablespoons sesame oil|1/2 cup carrots, cut into matchsticks|1/2 cup sliced shallots|4 cups fresh broccoli florets|1 tablespoon cornstarch|1 tablespoon soy sauce|1 tablespoon sesame seeds, or to taste",
    "rating": 5,
    "instructions": "Place chicken pieces in a bowl. Sprinkle with cornstarch, salt, and white pepper. Toss chicken to coat evenly and set aside.|Heat 1 teaspoon cooking oil in a small nonstick skillet over medium heat. Add garlic and ginger and cook, stirring, until fragrant, about 1 minute.|Stir in soy sauce, hoisin sauce, rice vinegar, sambal oelek, and sesame oil. Bring to a boil and cook, stirring, about 1 minute. Remove from heat and set aside.|Heat 2 tablespoons oil over medium-high heat in a large nonstick skillet or wok until very hot. Add chicken pieces carefully to the hot oil. Cook, stirring, until chicken pieces are lightly browned on all sides, 8 to 10 minutes total. The chicken pieces will cause spattering, so be sure to use a long-handled spoon or other utensil to move the chicken around.|Using a slotted spoon, remove chicken from the skillet and add the remaining 2 tablespoons cooking oil. Add carrots, shallots, and broccoli, and stir quickly and continually, 3 to 4 minutes.|Stir in prepared sauce, and cook until the vegetables are as tender as you like, 2 to 3 minutes.|Place cornstarch in a small bowl and stir in 1 tablespoon soy sauce. Keep stirring until there are no lumps. Add cornstarch slurry to the skillet and rapidly stir until well combined. Return chicken pieces and cook, stirring often, until heated through, 2 to 3 minutes.|Remove from heat, sprinkle with sesame seeds, and serve hot.",
    "notes": "This dish is perfect for a quick weekday dinner"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/shrimp_with_broccoli_in_garlic_sauce.jpg",
    "recipeName": "Shrimp with Broccoli in Garlic Sauce",
    "description": "I wanted to recreate my favorite Chinese shrimp and broccoli takeout dish. After several attempts, here is the result! Serve over hot cooked rice.",
    "ingredients": "2 cups fresh broccoli florets|1 tablespoon water|2 tablespoons peanut oil|4 large cloves garlic, minced|1 cup low-sodium chicken broth|1 tablespoon soy sauce|1 tablespoon oyster sauce|2 teaspoons grated fresh ginger root|1 pound uncooked medium shrimp, peeled and deveined|¼ cup canned water chestnuts, drained|2 tablespoons cornstarch",
    "rating": 4,
    "instructions": "Combine broccoli and water in a glass bowl; steam in microwave oven until slightly tender, 2 to 3 minutes.|Heat peanut oil in a large skillet or wok over medium-high heat. Add garlic and cook until fragrant, about 1 minute. Reduce heat to low. Add chicken broth, soy sauce, oyster sauce, and ginger root to the garlic; bring to a boil. Add shrimp; cook and stir until the shrimp turn pink, 3 to 4 minutes.|Toss steamed broccoli and water chestnuts with shrimp mixture to coat with sauce. Stir cornstarch into mixture, 1 tablespoon at a time, until sauce thickens, about 5 minutes.",
    "notes": "I wanted to recreate my favorite Chinese shrimp and broccoli takeout dish. After several attempts, here is the result! Serve over hot cooked rice."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/copycat_panda_express_chow_mein.png",
    "recipeName": "Copycat Panda Express Chow Mein",
    "description": "You can make this Panda Express menu favorite at home in less time than it'd take you to load in the car and hit the drive thru. Even better, you can customize our copycat chow mein easily by adding in any favorite veggies you have on hand. If you want to bulk this easy noodle dish into an entree, add your protein of choice—leftover chicken, shrimp, or a freshly fried egg would all make great additions (and they won't cost extra).",
    "ingredients": "3 tablespoons canola oil|1 tablespoon sesame oil|1/2 white onion, finely chopped|2 stalks celery, sliced|1 tablespoon chopped fresh ginger|3 cups shredded coleslaw mix|5 ounces bean sprouts|1 (7.1 ounce) package pre-cooked stir-fry noodles|1/4 cup tamari|2 tablespoons mirin",
    "rating": 3,
    "instructions": "Heat canola oil and sesame oil in a wok over high heat. Add onion, celery, and ginger; cook, stirring often, 1 minute. Add coleslaw mix and sprouts; cook, stirring constantly, 2 minutes. Add noodles, and cook, stirring constantly, 1 minute. Add tamari and mirin; cook, stirring occasionally, 2 minutes.",
    "notes": "You can make this Panda Express menu favorite at home in less time than it'd take you to load in the car and hit the drive thru. Even better, you can customize our copycat chow mein easily by adding in any favorite veggies you have on hand. If you want to bulk this easy noodle dish into an entree, add your protein of choice—leftover chicken, shrimp, or a freshly fried egg would all make great additions (and they won't cost extra)."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chicken_in_black_bean_sauce.jpg",
    "recipeName": "Chicken in Black Bean Sauce",
    "description": "Chicken in black bean sauce is delicious and simple to make at home for a restaurant-style Chinese stir-fry dish with lots of garlic, bell peppers, and bean sprouts.",
    "ingredients": "1 tablespoon cornstarch|1 tablespoon water|1 1/2 teaspoons light soy sauce|1 ½ teaspoons white sugar|1/2 teaspoon salt|6 skinless, boneless chicken breast halves, sliced|1 cup bean sprouts|1/4 cup water|2 teaspoons oyster sauce|1 teaspoon white sugar|1 tablespoon vegetable oil|3 tablespoons black bean sauce with garlic|1 tablespoon chopped garlic|1 onion, finely sliced|½ green bell pepper, chopped|2 teaspoons cornstarch|1 tablespoon water",
    "rating": 5,
    "instructions": "To make the marinade: Mix 1 tablespoon cornstarch with 1 tablespoon water in a bowl; stir in light soy sauce, sugar, and salt. Add chicken; toss to combine. Set aside to marinate for 20 minutes.|Bring water to a boil in a saucepan. Add bean sprouts; cook just until blanched, about 30 seconds; drain and set aside.|Combine 1/4 cup water, oyster sauce, and sugar together in a small bowl; set aside.|Heat vegetable oil in a skillet over high heat. Add black bean sauce and chopped garlic; cook and stir until fragrant, about 1 minute. Add onion; cook and stir until soft, 3 to 4 minutes.|Add chicken and marinade mixture; stir-fry until cooked through and no longer pink in the middle, about 4 to 5 minutes. Stir in oyster sauce mixture; cook until heated through. Cover and simmer until flavors blend, about 1 or 2 minutes. Stir in bell pepper; cover and cook until softened, 1 to 2 minutes more.|Dissolve 2 teaspoons cornstarch in 1 tablespoon water. Stir in bean sprouts and cornstarch mixture; cook until sauce is thickened, 2 to 3 minutes more.",
    "notes": "Chicken in black bean sauce is delicious and simple to make at home for a restaurant-style Chinese stir-fry dish with lots of garlic, bell peppers, and bean sprouts."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_tea_leaf_eggs.jpg",
    "recipeName": "Chinese Tea Leaf Eggs",
    "description": "Tea eggs are one of my favorite dishes and traditional lucky food to make for the Lunar New Year. These hard-boiled eggs are subtly flavored with anise and have a deep brown hue from black tea and soy. The marbled patterns from the cracked shells make these quite attractive. Store unpeeled eggs in a tightly sealed container in the refrigerator for four to five days. Recipe courtesy of Mom.",
    "ingredients": "3 cups water|2 tablespoons black tea leaves|1 tablespoon soy sauce|1 tablespoon black soy sauce|1 tablespoon tangerine zest|1 (2 inch) piece cinnamon stick|2 pods star anise|1 ¼ teaspoons salt, divided|8 large eggs",
    "rating": 4,
    "instructions": "Combine 3 cups water, tea leaves, soy sauce, black soy sauce, zest, cinnamon stick, star anise, and 1/4 teaspoon salt in a large saucepan; bring to a boil. Reduce heat, cover, and simmer for 3 hours.|Meanwhile, place eggs and remaining 1 teaspoon salt into a medium pot; cover with cold water. Bring to a boil, reduce heat, and simmer for 20 minutes. Remove from heat, drain, and cool. Tap cooled eggs with the back of a spoon to crack shells; do not remove shells.|Remove the saucepan from the heat. Add eggs and let steep for at least 8 hours, or for a richer flavor, up to 1 1/2 days.",
    "notes": "Tea eggs are one of my favorite dishes and traditional lucky food to make for the Lunar New Year. These hard-boiled eggs are subtly flavored with anise and have a deep brown hue from black tea and soy. The marbled patterns from the cracked shells make these quite attractive. Store unpeeled eggs in a tightly sealed container in the refrigerator for four to five days. Recipe courtesy of Mom."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/quick_beef_stir-fry.jpg",
    "recipeName": "Quick Beef Stir-Fry",
    "description": "Quick and easy beef stir-fry. I make this on my busiest weeknights.",
    "ingredients": "2 tablespoons vegetable oil|1 pound beef sirloin, cut into 2-inch strips|1 ½ cups fresh broccoli florets|1 red bell pepper, cut into matchsticks|2 carrots, thinly sliced|1 green onion, chopped|1 teaspoon minced garlic|2 tablespoons soy sauce|2 tablespoons sesame seeds, toasted",
    "rating": 4,
    "instructions": "Gather all ingredients.|Heat vegetable oil in a large wok or skillet over medium-high heat; cook and stir beef until browned, 3 to 4 minutes.|Move beef to the side of the wok and add broccoli, bell pepper, carrots, green onion, and garlic to the center of the wok. Cook and stir vegetables for 2 minutes.|Stir beef into vegetables and season with soy sauce and sesame seeds. Continue to cook and stir until vegetables are tender, about 2 more minutes.|Serve hot and enjoy!",
    "notes": "Quick and easy beef stir-fry. I make this on my busiest weeknights."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/asian_orange_chicken.jpg",
    "recipeName": "Asian Orange Chicken",
    "description": "This orange chicken recipe is sticky, sweet, and delicious. It tastes similar to the orange chicken from a popular Chinese restaurant in the mall! It's easier to make than you think for delicious takeout at home.",
    "ingredients": "1 ½ cups water|⅓ cup rice vinegar|¼ cup lemon juice|2 ½ tablespoons soy sauce|2 tablespoons orange juice|1 cup packed brown sugar|2 tablespoons chopped green onion|1 tablespoon grated orange zest|½ teaspoon minced fresh ginger root|½ teaspoon minced garlic|¼ teaspoon red pepper flakes|3 tablespoons cornstarch|2 tablespoons water|2 large skinless, boneless chicken breasts, cut into 1/2-inch cubes|1 cup all-purpose flour|¼ teaspoon salt|¼ teaspoon pepper|3 tablespoons olive oil",
    "rating": 4,
    "instructions": "Gather all ingredients.|Combine water, rice vinegar, lemon juice, soy sauce, and orange juice for sauce into a saucepan over medium-high heat. Stir in brown sugar, green onion, orange zest, ginger, garlic, and pepper flakes; bring to a boil. Remove from heat, and cool for 10 to 15 minutes.|Place chicken in a resealable plastic bag. Pour in 1 cup cooled sauce. Seal the bag, and refrigerate for at least 2 hours. Reserve the remaining sauce.|Mix flour, salt, and pepper in another resealable plastic bag.|Remove chicken from the marinade and place into the bag of seasoned flour. Seal the bag and shake to coat.|Heat the olive oil in a large skillet over medium heat. Cook chicken in the hot skillet until browned on both sides.|Remove to a paper towel-lined plate and cover with aluminum foil. Wipe out the skillet.|Pour reserved sauce into the skillet and bring to a boil over medium-high heat.|Mix together cornstarch and water until completely smooth. Stir into the boiling sauce.|Reduce heat to medium-low, add the chicken, and simmer, stirring occasionally, until cooked through, about 5 minutes.|Serve over rice and enjoy!",
    "notes": "This orange chicken recipe is sticky, sweet, and delicious. It tastes similar to the orange chicken from a popular Chinese restaurant in the mall! It's easier to make than you think for delicious takeout at home."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/perfect_pot_stickers.jpg",
    "recipeName": "Perfect Pot Stickers",
    "description": "These pot stickers made with homemade dough and filled with ground pork, ginger, garlic, and cabbage are so versatile — you can fill them with anything you want and as full as you want. The dumplings are fried and steamed, then fried again until golden and perfectly crispy on the bottom for a truly unique dumpling.",
    "ingredients": "1 pound ground pork|4 cloves minced garlic|½ cup finely chopped green onions|3 tablespoons very finely minced fresh ginger|2 tablespoons soy sauce|1 teaspoon soy sauce|1 teaspoon sesame oil|1 pinch cayenne pepper|1 ½ cups finely chopped green cabbage|2 ½ cups all-purpose flour, or more as needed|¾ teaspoon kosher salt|1 cup hot water, about 130 - 150 F (55-65 C)|¼ cup seasoned rice vinegar|¼ cup soy sauce|6 tablespoons vegetable oil for frying, or as needed - divided|8 tablespoons water for steaming, divided",
    "rating": 4,
    "instructions": "Place ground pork, green onions, garlic, ginger, 2 tablespoon plus 1 teaspoon soy sauce, sesame oil, and cayenne in a mixing bowl. Top with chopped green cabbage. Mix with fork until thoroughly combined. Tamp down lightly; cover with plastic. Refrigerate until chilled, about an hour.|Place 2 ½ cups of flour and kosher salt in a mixing bowl. Slowly pour in hot water. Stir with a wooden spoon until mixture forms a shaggy dough. Flour your hands and transfer dough to a work surface. Knead dough until it becomes smooth and elastic, about 3 to 5 minutes. If dough seems too sticky, sprinkle with a bit more flour, up to an additional 1/2 cup, and continue to knead. Wrap dough ball in plastic, and let it rest about 30 minutes.|When dough has rested, divide into 4 equal pieces. Cover 3 pieces with a dish cloth while you work the first piece. Roll into a small log about the thickness of a thumb, about 3/4 inch. Divide each log into 6 equal pieces. Roll each piece into a thin 3 ½-inch circle on a lightly floured surface to form the pot sticker wrappers. Repeat with the remaining dough pieces.|Lightly moisten the edges of a wrapper with your wet finger. Place a small scoop of the ground pork mixture onto the center of a wrapper. Fold up the 2 sides and pinch together in the center. Pinch together the remaining edges, forming \"pleats\" along one side. Tap the pot sticker on the work surface to slightly flatten the bottom; form a slight curve in it so it stands upright in the pan. Transfer to a well-floured plate. Repeat with remaining dough and filling.|Mix together seasoned rice vinegar and soy sauce in a small mixing bowl for the dipping sauce.|Heat oil in skillet over medium-high heat. Place about 6 or 7 pot stickers in the hot oil, flat side down. Cook until bottoms are golden brown, about 2 minutes. Drizzle in water and quickly cover the pan; steam for 3 minutes. Uncover; reduce heat to medium. Continue cooking until water evaporates and bottoms are browned and crunchy, 1 or 2 minutes. Transfer to a warm serving dish. Repeat with remaining pot stickers. Serve with dipping sauce.|Serve hot and enjoy!",
    "notes": "These pot stickers made with homemade dough and filled with ground pork, ginger, garlic, and cabbage are so versatile — you can fill them with anything you want and as full as you want. The dumplings are fried and steamed, then fried again until golden and perfectly crispy on the bottom for a truly unique dumpling."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/pork_dumplings.jpg",
    "recipeName": "Pork Dumplings",
    "description": "These tasty steamed pork dumplings make a perfect appetizer for a party or you can serve them as a main dish.&nbsp; Serve with hoisin sauce, hot Chinese-style mustard, and toasted sesame seeds.",
    "ingredients": "100 (3.5 inch square) wonton wrappers|1 ¾ pounds ground pork|1 tablespoon minced fresh ginger root|4 cloves garlic, minced|2 tablespoons thinly sliced green onion|4 tablespoons soy sauce|3 tablespoons sesame oil|1 egg, beaten|5 cups finely shredded Chinese cabbage",
    "rating": 4,
    "instructions": "In a large bowl, combine the pork, ginger, garlic, green onion, soy sauce, sesame oil, egg and cabbage. Stir until well mixed.|Place 1 heaping teaspoon of pork filling onto each wonton skin. Moisten edges with water and fold edges over to form a triangle shape. Roll edges slightly to seal in filling. Set dumplings aside on a lightly floured surface until ready to cook.|Arrange dumplings in a covered bamboo or metal steamer so they don't touch to prevent them from sticking together; steam for 15 minutes, or until pork is cooked through.|Serve hot and enjoy!",
    "notes": "These tasty steamed pork dumplings make a perfect appetizer for a party or you can serve them as a main dish.&nbsp; Serve with hoisin sauce, hot Chinese-style mustard, and toasted sesame seeds."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/super_easy_stir-fried_cabbage.jpg",
    "recipeName": "Super Easy Stir-Fried Cabbage",
    "description": "A cabbage stir-fry recipe that's very simple to make. Using only soy sauce in this recipe brings out the natural sweetness in the cabbage.",
    "ingredients": "1 tablespoon vegetable oil|2 cloves garlic, minced|1 pound shredded cabbage|1 tablespoon soy sauce|1 tablespoon Chinese cooking wine (Shaoxing wine)",
    "rating": 4,
    "instructions": "Heat vegetable oil in a wok or large skillet over medium heat. Stir in garlic and cook until it begins to brown, 3 to 5 seconds.|Stir in cabbage until coated in oil; cover the wok and cook for 1 minute.|Pour in soy sauce; cook and stir for another minute. Increase heat to high and stir in Chinese cooking wine. Cook and stir until cabbage is tender, about 2 minutes more.|Serve hot and enjoy!",
    "notes": "A cabbage stir-fry recipe that's very simple to make. Using only soy sauce in this recipe brings out the natural sweetness in the cabbage."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/kung_pao_chicken.jpg",
    "recipeName": "Kung Pao Chicken",
    "description": "This tasty kung pao chicken is similar to what is served in Chinese restaurants. It's easy to make, and you can be as creative with the measurements as you want. You can't go wrong! The sauce reduces until nice and thick.",
    "ingredients": "2 tablespoons cornstarch, dissolved in 2 tablespoons water|2 tablespoons white wine, divided|2 tablespoons soy sauce, divided|2 tablespoons sesame oil, divided|1 pound skinless, boneless chicken breast halves - cut into chunks|1 ounce hot chili paste|2 teaspoons brown sugar|1 teaspoon distilled white vinegar|1 (8 ounce) can water chestnuts|4 ounces chopped peanuts|4 green onions, chopped|1 tablespoon chopped garlic",
    "rating": 3,
    "instructions": "Combine water and cornstarch in a cup; set aside.|Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon sesame oil, and 1 tablespoon cornstarch/water mixture in a large glass bowl. Add chicken pieces and toss to coat. Cover the dish and refrigerate for about 30 minutes.|Combine remaining 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon sesame oil, and remaining cornstarch/water mixture in a medium bowl. Whisk in chili paste, brown sugar, and vinegar. Add water chestnuts, peanuts, green onions, and garlic and toss to coat.|Transfer water chestnut mixture to a medium skillet. Heat slowly over medium heat until aromatic.|Meanwhile, transfer chicken from marinade into a large skillet; cook over medium-high heat, stirring, until chicken is cooked through and juices run clear.|Combine water chestnut mixture and sautéed chicken together in one skillet. Adjust heat and simmer together until sauce thickens.",
    "notes": "This tasty kung pao chicken is similar to what is served in Chinese restaurants. It's easy to make, and you can be as creative with the measurements as you want. You can't go wrong! The sauce reduces until nice and thick."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/honey_walnut_shrimp.jpg",
    "recipeName": "Honey Walnut Shrimp",
    "description": "Honey walnut shrimp is a delicious Hong Kong-style dish of crispy battered shrimp topped with a creamy sauce and sugar-coated walnuts.",
    "ingredients": "1 cup water|⅔ cup white sugar|½ cup walnuts|4 large egg whites|⅔ cup mochiko (glutinous rice flour)|1 cup vegetable oil for frying|1 pound large shrimp, peeled and deveined|¼ cup mayonnaise|2 tablespoons honey|1 tablespoon canned sweetened condensed milk",
    "rating": 3,
    "instructions": "Stir water and sugar together in a small saucepan over high heat. Bring to a boil and add walnuts. Boil for 2 minutes, then drain and place walnuts on a cookie sheet to dry.|Whip egg whites in a medium bowl until foamy. Stir in mochiko until it has a pasty consistency.|Heat oil in a heavy deep skillet over medium-high heat.|Dip shrimp in mochiko batter, then fry in batches in hot oil until golden brown, about 5 minutes. Remove with a slotted spoon and drain on paper towels.|Stir together mayonnaise, honey, and sweetened condensed milk in a medium serving bowl. Add fried shrimp and toss to coat with sauce. Sprinkle candied walnuts on top and serve.",
    "notes": "Honey walnut shrimp is a delicious Hong Kong-style dish of crispy battered shrimp topped with a creamy sauce and sugar-coated walnuts."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/sweet_and_sour_pork.jpg",
    "recipeName": "Sweet and Sour Pork",
    "description": "Sweet and sour pork the way my husband's grandmother made it. She was Chinese and the secret is apple cider vinegar. This recipe is the way Gramma made sweet and sour dishes her whole life. It is the best!",
    "ingredients": "1 pound pork butt, cut into 1 inch cubes|1 teaspoon soy sauce|1 teaspoon salt|¼ teaspoon white sugar|1 egg white|2 green onions, chopped|1 quart vegetable oil for frying|½ cup cornstarch|1 tablespoon vegetable oil|3 stalks celery, cut into 1/2 inch pieces|1 medium green bell pepper, cut into 1 inch pieces|1 medium onion, cut into wedges|1 pinch white sugar, or to taste|salt to taste|1 ¼ cups water, divided|¾ cup white sugar|⅓ cup apple cider vinegar|¼ cup ketchup|½ teaspoon soy sauce|¼ teaspoon salt|1 (8 ounce) can pineapple chunks, undrained|2 tablespoons cornstarch",
    "rating": 5,
    "instructions": "Place cubed pork in a medium bowl and season with soy sauce, salt, and sugar for marinade. Add egg white and green onions and mix until well-combined. Cover and place in the refrigerator for at least 1 hour.|Heat 1 quart oil to 365 degrees F (185 degrees C) in a large, heavy saucepan or deep fryer.|Coat pork with cornstarch and fry in hot oil until evenly browned, about 10 minutes. Drain on paper towels and set aside.|Heat oil for vegetables in a wok over medium heat. Stir in celery, bell pepper, and onion; cook until tender, about 5 minutes. Season with pinch of sugar and salt. Remove from heat and set aside.|Mix 1 cup water, 3/4 cup sugar, apple cider vinegar, ketchup, soy sauce, and salt in a large saucepan; bring to a boil over high heat.|Stir in cooked pork, celery mixture, and pineapple chunks with juice. Return to a boil, then mix in remaining1/4 cup water and cornstarch. Cook until thickened and warmed through, about 2 minutes.",
    "notes": "Sweet and sour pork the way my husband's grandmother made it. She was Chinese and the secret is apple cider vinegar. This recipe is the way Gramma made sweet and sour dishes her whole life. It is the best!"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/mongolian_beef_and_spring_onions.jpg",
    "recipeName": "Mongolian Beef and Spring Onions",
    "description": "This Mongolian beef recipe with green onions has a soy-based sauce for a Chinese-style beef dish. Best served over soft rice noodles or rice.",
    "ingredients": "2 teaspoons vegetable oil|1 tablespoon finely chopped garlic|½ teaspoon grated fresh ginger root|⅔ cup dark brown sugar|½ cup soy sauce|½ cup water|1 pound beef flank steak, sliced 1/4 inch thick on the diagonal|¼ cup cornstarch|1 cup vegetable oil for frying|2 bunches green onions, cut in 2-inch lengths",
    "rating": 5,
    "instructions": "Heat 2 teaspoons of vegetable oil in a saucepan over medium heat. Add garlic and ginger; cook and stir until fragrant, about 30 seconds. Stir in brown sugar, soy sauce, and water. Increase heat to medium-high; stir until sauce boils and slightly thickens, about 4 minutes. Remove sauce from the heat and set aside.|Place beef into a large bowl; add cornstarch and mix until beef is thoroughly coated. Set aside until most of the cornstarch has been absorbed, about 10 minutes.|Heat vegetable oil in a deep skillet to 375 degrees F (190 degrees C).|Shake excess cornstarch from beef slices and drop into hot oil, a few at a time, stirring briefly and frying until edges become crisp, about 2 minutes. Remove beef with a large slotted spoon; drain on paper towels.|Remove excess oil from the skillet, then heat the skillet over medium heat; add beef slices and stir in prepared sauce. Add green onions and bring to a boil; cook until the onions have just softened and are bright green, about 1 to 2 minutes.MEGAN NIEVES",
    "notes": "This Mongolian beef recipe with green onions has a soy-based sauce for a Chinese-style beef dish. Best served over soft rice noodles or rice."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_pork_dumplings.jpg",
    "recipeName": "Chinese Pork Dumplings",
    "description": "These Chinese dumplings are from Liana Cafe House in Seattle's International District. They sell these traditional fried pork dumplings from a tiny takeout shop but with this recipe, you can see how to make them at home!",
    "ingredients": "½ cup soy sauce|1 tablespoon seasoned rice vinegar|1 tablespoon finely chopped Chinese chives|1 tablespoon sesame seeds|1 teaspoon chile-garlic sauce (such as Sriracha)|1 pound ground pork|3 cloves garlic, minced|1 large egg, beaten|2 tablespoons finely chopped Chinese chives|2 tablespoons soy sauce|1 ½ tablespoons sesame oil|1 tablespoon minced fresh ginger|50 dumpling wrappers|½ cup vegetable oil for frying, or as needed",
    "rating": 4,
    "instructions": "Prepare dipping sauce: Combine soy sauce, rice vinegar, chives, sesame seeds, and chile sauce in a small bowl. Set aside.|Prepare dumplings: Mix pork, garlic, egg, chives, soy sauce, sesame oil, and ginger in a large bowl until thoroughly combined.|Place a dumpling wrapper on a lightly floured work surface and spoon about 1 tablespoon of the filling in the middle.|Wet the edge with a little water and crimp together forming small pleats to seal the dumpling. Repeat to form remaining dumplings.|Heat 1 to 2 tablespoons vegetable oil in a large skillet over medium-high heat. Place 8 to 10 dumplings in the pan and cook until browned, about 2 minutes per side.|Pour in 1 cup of water; cover and cook until the dumplings are tender and pork is cooked through, about 5 minutes.|Repeat to cook remaining dumplings, adding more oil and water for each batch.|Serve dumplings with dipping sauce.ALLRECIPES MAGAZINE",
    "notes": "These Chinese dumplings are from Liana Cafe House in Seattle's International District. They sell these traditional fried pork dumplings from a tiny takeout shop but with this recipe, you can see how to make them at home!"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/char_siu_(chinese_bbq_pork).jpg",
    "recipeName": "Char Siu (Chinese BBQ Pork)",
    "description": "Char siu is Chinese restaurant-style pork with a deep red, sweet and sticky coating. Char siu literally means \"fork roast\" and refers to the traditional method of cooking this dish by which strips of seasoned pork were skewered with long forks and roasted in a covered oven or over a fire. This version uses pork tenderloin and is easy to make at home on your charcoal grill. Enjoy the sweet and salty taste on its own or serve it over rice or noodles.",
    "ingredients": "½ cup soy sauce|⅓ cup honey|⅓ cup ketchup|⅓ cup brown sugar|¼ cup Chinese rice wine|2 tablespoons hoisin sauce|2 tablespoons red bean curd (Optional)|1 teaspoon Chinese five-spice powder (Optional)|2 (1 pound) pork tenderloins",
    "rating": 5,
    "instructions": "Gather all ingredients.|Stir soy sauce, honey, ketchup, brown sugar, rice wine, hoisin sauce, red bean curd, and five-spice powder together in a saucepan over medium-low heat. Cook and stir until just combined and slightly warm, 2 to 3 minutes.|Meanwhile, slice each pork tenderloin lengthwise into 1 1/2- to 2-inch-thick strips. Place pork strips in a large, resealable plastic bag.|Pour marinade into the bag with the pork. Squeeze air from the bag, seal, and turn the bag a few times until pork is well coated. Marinate in the refrigerator, 2 hours to overnight.|When ready to cook, preheat a charcoal grill for medium-high heat and lightly oil the grate.|Remove pork from marinade and shake to remove excess liquid. Set aside the remaining marinade for basting.|Rake the hot coals into two equal piles on opposite sides of the charcoal grate. Add a small container of water to the grate. Place pork strips in the center of the grate for indirect cooking.|Cook pork over indirect heat, turning regularly and basting as desired, until an instant-read thermometer inserted into the center reads at least 145 degrees F (63 degrees C), 30 minutes or longer.|Serve hot and enjoy!",
    "notes": "Char siu is Chinese restaurant-style pork with a deep red, sweet and sticky coating. Char siu literally means \"fork roast\" and refers to the traditional method of cooking this dish by which strips of seasoned pork were skewered with long forks and roasted in a covered oven or over a fire. This version uses pork tenderloin and is easy to make at home on your charcoal grill. Enjoy the sweet and salty taste on its own or serve it over rice or noodles."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/grilled_asian_chicken.jpg",
    "recipeName": "Grilled Asian Chicken",
    "description": "Delicious Asian chicken with a sweet-savory glaze. This recipe is great for last-minute company or a quick dinner by rounding it out with a baked potato and tossed salad.",
    "ingredients": "¼ cup soy sauce|2 tablespoons honey|4 teaspoons sesame oil|2 cloves garlic, crushed|3 slices fresh ginger root|4 skinless, boneless chicken breast halves",
    "rating": 3,
    "instructions": "Combine soy sauce, honey, sesame oil, garlic, and ginger in a small microwave-safe bowl; heat in the microwave on medium power for 1 minute, then stir. Heat again for 30 seconds, watching closely to prevent boiling.|Place chicken breasts in a shallow dish. Pour soy sauce mixture over top and set aside to marinate for 15 minutes.|Preheat an outdoor grill for medium-high heat and lightly oil the grate.|Meanwhile, remove chicken from marinade; transfer marinade into a small saucepan and bring to a boil. Reduce heat to low and simmer until thick, about 1 minute. Set aside for basting.|Cook chicken on the preheated grill, basting frequently with reserved marinade, until golden brown on all sides and chicken is no longer pink in the center, about 6 to 8 minutes per side. An instant-read meat thermometer inserted into the thickest piece should read at least 160 degrees F (70 degrees C).",
    "notes": "Delicious Asian chicken with a sweet-savory glaze. This recipe is great for last-minute company or a quick dinner by rounding it out with a baked potato and tossed salad."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_steamed_buns.jpg",
    "recipeName": "Chinese Steamed Buns",
    "description": "These steamed buns are yummy Chinese dim sum that can be made with or without meat filling. To make these tasty buns, you'll need a wok equipped with a stainless steel steam plate. After steaming the buns, make sure to remove the lid carefully so condensation doesn't drip onto the buns, as this will produce yellowish blisters on the bun surface. You may use milk in place of the warm water if you wish.",
    "ingredients": "1 ¾ cups all-purpose flour, divided|¾ cup warm water, divided|1 tablespoon active dry yeast|1 teaspoon white sugar|2 tablespoons white sugar|1 tablespoon vegetable oil|¼ teaspoon salt|½ teaspoon baking powder",
    "rating": 4,
    "instructions": "Mix together 1/4 cup flour, 1/4 cup warm water, yeast, and 1 teaspoon sugar in a large bowl. Allow to sit for 30 minutes.|Mix in remaining 1 1/2 cups flour, remaining 1/2 cup warm water, 2 tablespoons sugar, vegetable oil, and salt. Knead until dough is smooth and elastic. Transfer to a greased bowl, roll to coat with oil, and let sit until tripled in size, 2 1/2 to 3 hours.|Punch down dough and spread out on a floured board. Sprinkle baking powder evenly on surface of dough; knead for 5 minutes.|Divide dough in half; set aside one half in a covered bowl. Divide remaining half into 12 equal pieces. Shape each into a ball; transfer each ball to a small square of waxed paper with the smooth surface facing up. Repeat portioning and shaping with remaining dough half. Cover all 24 dough balls and let sit until doubled in size, about 30 minutes.|Bring some water to a boil in a wok, then reduce heat to medium and keep water at a low boil. Place the steam plate on a small wire rack in the middle of the wok, leaving at least 2 inches of space between the plate and the wok. Working in batches, place buns on waxed paper squares onto the steam plate, leaving 1 to 2 inches between buns.|Cover and steam buns for 15 minutes. Carefully remove the lid, so condensation doesn't drip onto buns. Continue steaming remaining buns until all are cooked.",
    "notes": "These steamed buns are yummy Chinese dim sum that can be made with or without meat filling. To make these tasty buns, you'll need a wok equipped with a stainless steel steam plate. After steaming the buns, make sure to remove the lid carefully so condensation doesn't drip onto the buns, as this will produce yellowish blisters on the bun surface. You may use milk in place of the warm water if you wish."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/black_pepper_chicken.jpg",
    "recipeName": "Black Pepper Chicken",
    "description": "This black pepper chicken tastes just like the Chinese takeout favorite, golden-fried chicken in a soy, wine, and black pepper sauce, and served over white rice.",
    "ingredients": "1/4 cup cornstarch|1 tablespoon reduced-sodium soy sauce|1 tablespoon Shaoxing wine|1 teaspoon freshly ground black pepper|1 pound skinless boneless chicken thighs, cut into 1-inch pieces|1/4 cup low-sodium chicken broth|1/4 cup oyster sauce|2 tablespoons wine|2 tablespoons reduced-sodium soy sauce|1 tablespoon water|1 tablespoon cornstarch|1 teaspoon freshly ground black pepper|3 tablespoons vegetable oil, divided|1 tablespoon minced garlic|1 teaspoon minced fresh ginger|1 cup green bell pepper, cut into 1/2-inch pieces|1 cup white onion, cut into 1/2-inch pieces|2 cups cooked white rice",
    "rating": 4,
    "instructions": "Gather Ingredients.|For Chicken Coating, whisk together cornstarch, soy sauce, Shaoxing wine, and pepper in a large bowl. Mixture will be quite thick. Add chicken pieces to bowl; stir to coat chicken. Let stand at room temperature for 15 minutes.|Meanwhile, for Black Pepper Sauce, whisk together chicken broth, oyster sauce, Shaoxing wine, soy sauce, water, cornstarch, and pepper in a medium bowl.|Heat 2 tablespoons vegetable oil in a 12-inch skillet over medium-high heat. Add half the chicken. Cook and stir until lightly browned and no longer pink, about 5 minutes. Transfer chicken to a plate; set aside. Repeat with remaining chicken. Remove chicken from skillet.|Add remaining 1 tablespoon vegetable oil to skillet. Stir in minced garlic and ginger. Cook and stir until fragrant, about 30 seconds. Stir in bell pepper and onion. Cook and stir until crisp-tender, 2 to 3 minutes.|Pour in Black Pepper Sauce and cook until sauce has thickened, 2 to 3 minutes. Return cooked chicken to skillet. Cook and stir until all ingredients are coated with sauce. Serve immediately over cooked white rice.",
    "notes": "This black pepper chicken tastes just like the Chinese takeout favorite, golden-fried chicken in a soy, wine, and black pepper sauce, and served over white rice."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/shrimp_egg_foo_young.jpg",
    "recipeName": "Shrimp Egg Foo Young",
    "description": "This egg foo young recipe includes a delicious sauce to put on top of the patties. This is a very special recipe acquired when I worked at a Chinese restaurant to pay for my red 1966 VW bug when in high school! The recipe card is tattered and spotted now, but the dish is the best egg foo young I have ever had. To serve, place egg patty over steamed rice and put the sauce on top.",
    "ingredients": "8 ounces fresh bean sprouts|1 cup cooked small shrimp|4 large eggs|⅓ cup thinly sliced green onions|¼ teaspoon garlic powder|2 tablespoons vegetable oil|3 cups chicken broth|2 tablespoons cornstarch|2 tablespoons sugar|2 tablespoons Chinese cooking wine, sherry, or apple cider vinegar|2 tablespoons soy sauce",
    "rating": 4,
    "instructions": "Mix bean sprouts, shrimp, eggs, green onions, and garlic powder together in a large bowl until well combined.|Heat oil in a skillet over medium heat. Add about 1/2 cup of egg mixture into the skillet to make a patty. Repeat to add more patties to the skillet. Working in batches, fry patties until golden brown, about 4 minutes per side.|Meanwhile, make the sauce: Whisk chicken broth, cornstarch, sugar, cooking wine, and soy sauce together in a saucepan over medium-low heat; simmer until sauce thickens, about 5 minutes.|Spoon sauce over patties.",
    "notes": "This egg foo young recipe includes a delicious sauce to put on top of the patties. This is a very special recipe acquired when I worked at a Chinese restaurant to pay for my red 1966 VW bug when in high school! The recipe card is tattered and spotted now, but the dish is the best egg foo young I have ever had. To serve, place egg patty over steamed rice and put the sauce on top."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_spareribs.jpg",
    "recipeName": "Chinese Spareribs",
    "description": "These Chinese spareribs are tender, juicy, and tangy. I created this recipe after nothing caught my eye while searching for a good sparerib recipe. I cooked this in the broiler, but it should be fine on the grill or in the oven.",
    "ingredients": "3 tablespoons hoisin sauce|1 tablespoon ketchup|1 tablespoon honey|1 tablespoon soy sauce|1 tablespoon sake (or Chinese rice wine)|1 teaspoon rice vinegar|1 teaspoon lemon juice|1 teaspoon grated fresh ginger|½ teaspoon grated fresh garlic|¼ teaspoon Chinese five-spice powder|1 pound pork spareribs",
    "rating": 5,
    "instructions": "Mix hoisin sauce, ketchup, honey, soy sauce, sake, rice vinegar, lemon juice, ginger, garlic, and five-spice powder together in a shallow glass dish. Place ribs in the dish and turn to coat. Cover and marinate in the refrigerator for 2 hours or up to overnight.|Preheat the oven to 325 degrees F (165 degrees C). Fill a broiler tray with enough water to cover the bottom. Place the grate or a rack over the tray; arrange ribs on the grate.|Cook in the preheated oven on the center rack for 40 minutes, turning and brushing with marinade every 10 minutes. Let marinade cook on for final 10 minutes to make a glaze. Finish under the broiler if desired. Discard any remaining marinade.",
    "notes": "These Chinese spareribs are tender, juicy, and tangy. I created this recipe after nothing caught my eye while searching for a good sparerib recipe. I cooked this in the broiler, but it should be fine on the grill or in the oven."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/general_tso's_chicken.jpg",
    "recipeName": "General Tso's Chicken",
    "description": "General Tso's chicken is crispy, twice-fried chicken in a deliciously sweet and sticky glaze. This mouthwatering dish delivers a combination of Asian flavors that will knock your chopsticks off! Serve with steamed broccoli and white rice and garnish with sliced green onions.",
    "ingredients": "4 cups vegetable oil for frying|1 large egg|1 ½ pounds skinless, boneless chicken thighs, cut into 1 1/2-inch pieces|1 teaspoon salt|1 teaspoon white sugar|1 pinch white pepper|1 cup cornstarch|2 tablespoons vegetable oil|3 tablespoons chopped green onion|1 clove garlic, minced|6 dried whole red chilies|1 strip orange zest|½ cup white sugar|¼ cup soy sauce|3 tablespoons chicken broth|2 tablespoons peanut oil|1 tablespoon rice vinegar|2 teaspoons sesame oil|¼ teaspoon ground ginger|2 teaspoons cornstarch|¼ cup water",
    "rating": 3,
    "instructions": "Heat vegetable oil in a deep fryer or large saucepan to 375 degrees F (190 degrees C).|Whisk egg in large mixing bowl. Add chicken, salt, sugar, and pepper; mix well. Mix in cornstarch, a little bit at a time, until chicken is well coated.|Working in batches, carefully drop one piece of chicken at a time into the hot oil. Fry until chicken turns golden brown and begins to float, about 3 minutes. Remove chicken to a plate and allow to cool as you fry the next batch.|Once all of the chicken has been fried, refry the chicken, starting with the batch that was cooked first. Fry each batch until chicken turns deep golden brown, about 2 minutes more. Drain on a paper towel-lined plate.|Prepare sauce: Heat vegetable oil in a wok or large skillet over high heat. Stir in green onion, garlic, whole chiles, and orange zest. Cook and stir until garlic turns golden and chiles brighten, 1 to 2 minutes.|Add sugar, soy sauce, chicken broth, peanut oil, rice vinegar, sesame oil, and ginger; bring to a boil and cook for 3 minutes. Whisk 2 teaspoons of cornstarch in water until dissolved. Stir into the boiling sauce. Return to a boil and cook until the sauce thickens and is no longer cloudy from the cornstarch, about 1 minute.|Stir chicken into the boiling sauce. Reduce heat to low and cook until chicken is heated through and has absorbed some of the sauce, about 3 minutes.",
    "notes": "General Tso's chicken is crispy, twice-fried chicken in a deliciously sweet and sticky glaze. This mouthwatering dish delivers a combination of Asian flavors that will knock your chopsticks off! Serve with steamed broccoli and white rice and garnish with sliced green onions."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/easy_chinese_corn_soup.jpg",
    "recipeName": "Easy Chinese Corn Soup",
    "description": "This quick and easy Chinese corn soup is so good that I never bother ordering it from restaurants anymore!",
    "ingredients": "1 (15 ounce) can cream style corn|1 (14.5 ounce) can low-sodium chicken broth|1 tablespoon cornstarch|2 tablespoons water|1 large egg, beaten",
    "rating": 4,
    "instructions": "Combine corn and chicken broth in a saucepan. Bring to a boil over medium-high heat.|Mix together cornstarch and water in a small bowl or cup; pour into the boiling corn soup, and continue cooking for about 2 minutes, or until thickened.|Gradually add beaten egg while stirring the soup. Remove from heat and serve.",
    "notes": "This quick and easy Chinese corn soup is so good that I never bother ordering it from restaurants anymore!"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/wonton_soup.jpg",
    "recipeName": "Wonton Soup",
    "description": "Wonton soup is a simple, light, Chinese classic with pork-filled dumplings in seasoned chicken broth. Whether in soup or fried, wontons always add delicious, hearty flavor to any dish!",
    "ingredients": "½ pound boneless pork loin, coarsely chopped|2 ounces peeled shrimp, finely chopped|1 tablespoon Chinese rice wine|1 tablespoon light soy sauce|1 teaspoon brown sugar|1 teaspoon finely chopped green onions|1 teaspoon chopped fresh ginger root|24 (3.5 inch square) wonton wrappers|3 cups chicken stock|2 tablespoons finely chopped green onions",
    "rating": 4,
    "instructions": "Make the wontons: Mix pork, shrimp, rice wine, soy sauce, brown sugar, green onions, and ginger together in a large bowl until well combined. Let stand for 25 to 30 minutes.|Spoon about 1 teaspoon filling onto the center of a wonton wrapper. Moisten all four wrapper edges with water and fold over filling to make a triangle; press the edges firmly to seal. Bring left and right corners together above filling; overlap the tips of these corners, moisten with water, and press together to seal. Repeat until all wrappers have been filled and sealed.|Make the soup: Bring chicken stock to a rolling boil in a pot. Gently drop in wontons and cook for 5 minutes.|Ladle into bowls and garnish with green onions.",
    "notes": "Wonton soup is a simple, light, Chinese classic with pork-filled dumplings in seasoned chicken broth. Whether in soup or fried, wontons always add delicious, hearty flavor to any dish!"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_pepper_steak.jpg",
    "recipeName": "Chinese Pepper Steak",
    "description": "A delicious pepper steak recipe served with boiled white rice — easy and made from items I've already got in my cupboards. My mother clipped this recipe from somewhere and it became a specialty of mine; however, I've been unable to find the original source.",
    "ingredients": "1 pound beef top sirloin steak|¼ cup soy sauce|2 tablespoons white sugar|2 tablespoons cornstarch|½ teaspoon ground ginger|3 tablespoons vegetable oil, divided|1 red onion, cut into 1-inch squares|1 green bell pepper, cut into 1-inch squares|2 tomatoes, cut into wedges",
    "rating": 4,
    "instructions": "Slice steak into 1/2-inch thick slices across the grain.|Whisk together soy sauce, sugar, cornstarch, and ginger in a bowl until the sugar has dissolved and the mixture is smooth. Place steak slices into the marinade, and stir until well-coated.|Heat 1 tablespoon vegetable oil in a wok or large skillet over medium-high heat, and cook steak strips in batches in hot oil so as not to crowd the pan. Cook and stir until well-browned, about 3 minutes, and remove steak from the wok to a bowl. Repeat with remaining steak, adding more oil as needed, and set the cooked meat aside.|Return cooked steak strips to the hot wok, and stir in onion. Toss steak and onion together until onion begins to soften, about 2 minutes, then stir in green pepper.|Cook and stir the mixture until peppers have turned bright green and started to become tender, about 2 minutes more, then add tomatoes.|Stir everything together to mix and blend flavors, and serve.",
    "notes": "A delicious pepper steak recipe served with boiled white rice — easy and made from items I've already got in my cupboards. My mother clipped this recipe from somewhere and it became a specialty of mine; however, I've been unable to find the original source."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/authentic_chinese_egg_rolls_(from_a_chinese_person).jpg",
    "recipeName": "Authentic Chinese Egg Rolls (from a Chinese person)",
    "description": "These Chinese egg rolls come from my mom who is the best cook ever — and I am a picky eater. If I like this, then you will. This is very authentic because my family is Chinese and I am too. This recipe is at least 300 years old in the Ling family.",
    "ingredients": "4 teaspoons vegetable oil, divided|3 large eggs, beaten|1 medium head cabbage, finely shredded|½ carrot, julienned|1 pound Chinese barbequed or roasted pork, cut into matchsticks|1 (8 ounce) can shredded bamboo shoots|1 cup dried, shredded wood ear mushroom, rehydrated|2 green onions, thinly sliced|2 ½ teaspoons soy sauce|1 teaspoon salt|1 teaspoon sugar|½ teaspoon monosodium glutamate (MSG)|1 (14 ounce) package egg roll wrappers|1 egg white, beaten|4 cups oil for frying, or as needed",
    "rating": 3,
    "instructions": "Heat 1 teaspoon vegetable oil in a wok or large skillet over medium heat. Pour in beaten eggs and cook, without stirring, until firmed up. Flip eggs over and cook for an additional 20 seconds to firm the other side. Set egg pancake aside to cool, then slice into thin strips.|Heat remaining vegetable oil in a wok or large skillet over high heat. Stir in cabbage and carrot; cook for 2 minutes to wilt. Add pork, bamboo shoots, mushroom, green onions, soy sauce, salt, sugar, and MSG; continue cooking until vegetables soften, about 6 minutes. Stir in sliced egg, then spread the mixture out onto a pan, and refrigerate until cold, about 1 hour.|To assemble the egg rolls: Place a wrapper onto your work surface with one corner pointing towards you. Place about 3 tablespoons of cooled filling in a heap onto the bottom third of the wrapper. Brush a little beaten egg white onto the top two edges of the wrapper, then fold the bottom corner over the filling and roll firmly to the halfway point. Fold the left and right sides snugly over the egg roll, then continue rolling until the top corners seal the egg roll with the egg white. Repeat with remaining egg roll wrappers, covering finished egg rolls with plastic wrap to keep from drying out.|Heat about 6 inches of oil in a wok or deep-fryer to 350 degrees F (175 degrees C).|Fry egg rolls 3 or 4 at a time until golden brown, 5 to 7 minutes. Drain on paper towels.MOODTWOFOOD",
    "notes": "These Chinese egg rolls come from my mom who is the best cook ever — and I am a picky eater. If I like this, then you will. This is very authentic because my family is Chinese and I am too. This recipe is at least 300 years old in the Ling family."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/general_tao_chicken.jpg",
    "recipeName": "General Tao Chicken",
    "description": "This General Tao chicken tastes the same as the one served in Chinese restaurants, without the deep frying. Serve on steamed jasmine or basmati rice.",
    "ingredients": "2 pounds skinless, boneless chicken breast halves - cut into bite-size pieces|¼ cup cornstarch|2 large eggs|1 teaspoon salt|½ teaspoon ground black pepper|6 tablespoons all-purpose flour|1 teaspoon baking powder|½ cup vegetable oil|½ cup chopped green onion|2 tablespoons grated fresh ginger root|4 teaspoons sesame oil|½ cup water|½ cup white sugar|¼ cup distilled white vinegar|2 tablespoons cornstarch|2 tablespoons soy sauce|¼ cup oyster sauce|¼ cup ketchup",
    "rating": 4,
    "instructions": "Coat chicken pieces with cornstarch in a bowl; set aside.|Beat eggs, salt, and pepper in a mixing bowl until combined. Stir in flour and baking powder until no large lumps remain. Mix in chicken pieces until evenly coated.|Heat vegetable oil in a large skillet or wok over high heat. Cook chicken in hot oil until golden brown and no longer pink on the inside, about 12 minutes. Set chicken aside; keep warm.|Make sauce: Reduce heat to medium-high; add green onion, ginger, and sesame oil to the skillet. Cook and stir until onion is limp and ginger begins to brown, about 1 minute. Pour in water, sugar, and vinegar; bring to a boil.|Dissolve cornstarch in soy sauce in a small bowl and stir into vinegar mixture along with oyster sauce and ketchup. Cook until sauce has thickened and is no longer cloudy. Stir in chicken; simmer until heated through.",
    "notes": "This General Tao chicken tastes the same as the one served in Chinese restaurants, without the deep frying. Serve on steamed jasmine or basmati rice."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/restaurant_style_egg_drop_soup.jpg",
    "recipeName": "Restaurant Style Egg Drop Soup",
    "description": "This chicken egg drop soup is born from a love of the soup, many trips to my favorite Chinese restaurant, and many questions. This variation is the result. Simplicity is the key. The soup can be reheated or frozen and reheated.",
    "ingredients": "4 cups chicken broth, divided|2 tablespoons chopped fresh chives|¼ teaspoon salt|⅛ teaspoon ground ginger|1 ½ tablespoons cornstarch|2 eggs|1 egg yolk",
    "rating": 4,
    "instructions": "Gather all ingredients.|Reserve 3/4 cup of chicken broth, and pour the rest into a large saucepan. Stir in chives, salt, and ginger; bring to a rolling boil. Stir reserved 3/4 cup of broth and cornstarch until smooth. Set aside.|Whisk eggs and egg yolk together in a small bowl with a fork. Using a fork, drizzle eggs, a little at a time, into boiling broth. Eggs will cook immediately.|Stir in cornstarch mixture gradually until soup reaches desired consistency.",
    "notes": "This chicken egg drop soup is born from a love of the soup, many trips to my favorite Chinese restaurant, and many questions. This variation is the result. Simplicity is the key. The soup can be reheated or frozen and reheated."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_chicken_wings.jpg",
    "recipeName": "Chinese Chicken Wings",
    "description": "These Chinese chicken wings were my late mother's recipe for potlucks. Now I am asked to bring this dish to parties.",
    "ingredients": "2 cups soy sauce|2 cups brown sugar|2 tablespoons garlic powder|5 pounds chicken wings, split and tips discarded",
    "rating": 4,
    "instructions": "Stir together soy sauce, brown sugar, and garlic powder in a saucepan over medium heat. Cook and stir until sugar has dissolved. Remove from heat and allow to cool.|Place chicken wings in a large bowl. Pour soy sauce mixture over wings and toss to coat evenly. Cover the bowl with plastic wrap. Allow chicken to marinate in the refrigerator for 8 hours to overnight.|Preheat the oven to 350 degrees F (175 degrees C).|Pour chicken wings and marinade into a 9x13-inch baking dish. Cover the baking dish with aluminum foil.|Bake in the preheated oven until thoroughly hot, about 45 minutes. Remove foil and bake for 15 more minutes. Serve hot.",
    "notes": "These Chinese chicken wings were my late mother's recipe for potlucks. Now I am asked to bring this dish to parties."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/moo_shu_chicken.jpg",
    "recipeName": "Moo Shu Chicken",
    "description": "Make classic moo shu chicken at home instead of eating at a restaurant or getting takeout. This dish is simple and bursting with flavor. Serve over rice or Chinese mandarin pancakes if desired.",
    "ingredients": "6 tablespoons cold water, divided|3 teaspoons sesame oil, divided|2 teaspoons cornstarch|1 pound chicken breast tenderloins, cut into thin strips|2 tablespoons hoisin sauce|2 tablespoons oyster sauce|2 teaspoons soy sauce|2 teaspoons vegetable oil, divided|2 large eggs, beaten|3 cups shredded cabbage or coleslaw mix|1 (4 ounce) can sliced shiitake mushrooms, drained|2 cloves garlic, minced|1 tablespoon sherry|3 green onions, chopped",
    "rating": 4,
    "instructions": "Whisk 2 tablespoons water, 2 teaspoons sesame oil, and cornstarch together in a large bowl. Add chicken, toss to coat, and set aside.|Combine remaining 4 tablespoons water and 1 teaspoon sesame oil in a separate bowl. Whisk in hoisin sauce, oyster sauce, and soy sauce until well combined; set sauce aside.|Heat 1 teaspoon oil in a skillet over medium heat. Add eggs and cook for 3 minutes; flip and cook until firm and set, about 3 minutes more. Transfer to a cutting board and slice into thin strips.|Add marinated chicken to the skillet and cook over medium-high heat for 6 minutes. Flip and cook until golden brown on the outside and the juices run clear, about 6 minutes more; transfer to a plate.|Heat remaining 1 teaspoon oil in the skillet over medium-high heat. Add cabbage, shiitake mushrooms, garlic, and sherry; cook until cabbage starts to wilt, about 2 minutes. Add chicken, sliced egg, and reserved sauce to the skillet; cook, stirring occasionally, until sauce has thickened, about 5 minutes. Toss in green onions and serve immediately.",
    "notes": "Make classic moo shu chicken at home instead of eating at a restaurant or getting takeout. This dish is simple and bursting with flavor. Serve over rice or Chinese mandarin pancakes if desired."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/velveting_chicken_breast,_chinese_restaurant_style.jpg",
    "recipeName": "Velveting Chicken Breast, Chinese Restaurant Style",
    "description": "Velveting chicken makes it as moist and tender as what's served at the best Chinese restaurants. This is not my technique — I got it online. Don't limit this chicken to just Chinese dishes. The velveted chicken can then be stir-fried with vegetables and sauce or stored for a few hours in the refrigerator before cooking.",
    "ingredients": "1 large egg white|1 tablespoon Chinese rice vinegar|1 tablespoon cornstarch|1 teaspoon kosher salt|1 pound skinless, boneless chicken breast, thinly sliced|8 cups water|1 tablespoon peanut oil",
    "rating": 4,
    "instructions": "Whisk together egg white, vinegar, cornstarch, and salt in a large bowl until smooth. Add sliced chicken; mix to coat thoroughly. Cover with plastic wrap and marinate in the refrigerator for 30 minutes.|Bring water and oil to a boil in a pot over high heat. Reduce heat to medium.|Remove chicken from the marinade and shake off excess; discard remaining marinade. Add chicken to boiling water and cook until just white on the outside but not completely cooked through, about 1 minute.|Drain chicken and finish cooking in a hot oiled wok or skillet until no longer pink in the center and the juices run clear, or store parboiled chicken in the refrigerator in a sealed container until ready to use, up to a few hours.",
    "notes": "Velveting chicken makes it as moist and tender as what's served at the best Chinese restaurants. This is not my technique — I got it online. Don't limit this chicken to just Chinese dishes. The velveted chicken can then be stir-fried with vegetables and sauce or stored for a few hours in the refrigerator before cooking."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/crispy_ginger_beef.jpg",
    "recipeName": "Crispy Ginger Beef",
    "description": "This ginger beef recipe is so much better than takeout! Serve it with homemade fried rice or plain rice. If you like spicy, just add more chili pepper flakes.",
    "ingredients": "¾ cup cornstarch|½ cup water|2 large eggs|1 pound flank steak, cut into thin strips|½ cup canola oil, or as needed|1 large carrot, cut into matchstick-size pieces|1 green bell pepper, cut into matchstick-size pieces|1 red bell pepper, cut into matchstick-size pieces|3 green onions, chopped|¼ cup minced fresh ginger root|5 garlic cloves, minced|½ cup white sugar|¼ cup rice vinegar|3 tablespoons soy sauce|1 tablespoon sesame oil|1 tablespoon red pepper flakes, or to taste",
    "rating": 3,
    "instructions": "Place cornstarch in a large bowl; gradually whisk in water until smooth. Whisk eggs into cornstarch mixture; toss steak strips in mixture to coat.|Pour canola oil into a wok, 1-inch deep; heat oil over high heat until hot but not smoking. Place 1/4 of the beef strips into hot oil; separate strips with a fork. Cook, stirring frequently, until coating is crisp and golden, about 3 minutes. Remove beef to drain on paper towels; repeat with remaining beef.|Drain off all but 1 tablespoon oil; cook and stir carrot, bell peppers, green onions, ginger, and garlic over high heat until lightly browned but still crisp, about 3 minutes.|Whisk sugar, rice vinegar, soy sauce, sesame oil, and red pepper flakes together in a small bowl. Pour sauce mixture over vegetables in wok; bring mixture to a boil. Stir beef back into vegetable mixture; cook and stir just until heated through, about 3 minutes.",
    "notes": "This ginger beef recipe is so much better than takeout! Serve it with homemade fried rice or plain rice. If you like spicy, just add more chili pepper flakes."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/easy_chinese_fried_noodles.jpg",
    "recipeName": "Easy Chinese Fried Noodles",
    "description": "These fried noodles are a quick, easy, and delicious recipe that all will enjoy. Try adding cooked, cubed pork or chicken. Bean sprouts, water chestnuts, sliced almonds, or any of your favorite vegetables can also be added to this versatile recipe.",
    "ingredients": "2 (3 ounce) packages soy sauce-flavored ramen noodles with seasoning packets|2 tablespoons vegetable oil, divided|3 large eggs, beaten|2 teaspoons vegetable oil, divided|4 green onions, thinly sliced|1 small carrot, peeled and grated|½ cup green peas|¼ cup red bell pepper, minced|2 tablespoons sesame oil|1 teaspoon sesame oil, or to taste|1 teaspoon soy sauce, or to taste",
    "rating": 4,
    "instructions": "Bring a medium pot of water to a boil. Cook ramen noodles, reserving seasoning packets, in boiling water until softened, about 3 minutes. Drain noodles and set aside.|Heat 1 tablespoon vegetable oil in a small skillet. Cook and stir beaten eggs in hot oil until scrambled and firm. Set aside.|Heat 1 teaspoon vegetable oil in a large skillet over medium heat. Cook and stir green onions in hot oil until softened, 2 to 3 minutes. Remove green onions to a plate; set aside.|Heat remaining 1 teaspoon vegetable oil in the same skillet over medium heat. Cook and stir carrots, peas, and bell pepper separately until softened, removing each to the plate with green onions when done.|Combine 2 tablespoons sesame oil with remaining 1 tablespoon vegetable oil in the same large skillet or a wok over medium heat. Fry cooked noodles in hot sesame-vegetable oil, tossing frequently, until golden, 3 to 5 minutes. Season with desired amounts of sesame oil, soy sauce, and reserved ramen seasoning packets; toss to coat. Stir in cooked vegetables, tossing frequently, until heated through, about 5 more minutes.",
    "notes": "These fried noodles are a quick, easy, and delicious recipe that all will enjoy. Try adding cooked, cubed pork or chicken. Bean sprouts, water chestnuts, sliced almonds, or any of your favorite vegetables can also be added to this versatile recipe."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_black_bean_sauce.jpg",
    "recipeName": "Chinese Black Bean Sauce",
    "description": "This black bean sauce recipe with garlic, chiles, and ginger creates a popular Chinese stir-fry sauce that's pungent and earthy. It's easy to make and will last in the refrigerator for up to a month. Because of the saltiness of the beans, there is no need to add salt in the recipes where you use this sauce.",
    "ingredients": "8 ounces dried fermented black beans|1 ½ cups vegetable oil|4 Thai chiles, chopped|1 medium shallot, minced|1 (2 inch) piece fresh ginger, peeled and grated|3 cloves garlic, minced|3 tablespoons reduced-sodium tamari|2 tablespoons Shaoxing rice wine|1 teaspoon brown sugar|½ teaspoon ground Sichuan pepper|½ teaspoon Chinese five-spice powder|1 teaspoon sesame oil",
    "rating": 4,
    "instructions": "Rinse black beans thoroughly and dry. Remove about 1/4 cup and set aside. Roughly chop the rest of the beans.|Heat vegetable oil in a large saucepan over medium-low heat. Add chiles, shallot, ginger, and garlic. Fry until soft and fragrant, about 5 minutes. Do not let the ingredients burn. Reduce the heat if necessary. The objective is to slow cook the ingredients.|Add all the beans; both chopped and whole. Simmer, stirring often, until the beans are soft, about 2 minutes. Add tamari, rice wine, brown sugar, ground Sichuan pepper, and five spice. Simmer until thickened, stirring often. Remove from heat; let cool, about 10 minutes.|Mix in sesame oil and cover. As the sauce rests, the beans will settle and the oil will float, creating a barrier which will protect it from mold. The sauce is ready to use or store in an airtight container in the refrigerator for up to 1 month.",
    "notes": "This black bean sauce recipe with garlic, chiles, and ginger creates a popular Chinese stir-fry sauce that's pungent and earthy. It's easy to make and will last in the refrigerator for up to a month. Because of the saltiness of the beans, there is no need to add salt in the recipes where you use this sauce."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chicken_fried_rice.jpg",
    "recipeName": "Chicken Fried Rice",
    "description": "This chicken fried rice recipe is very easy and tasty! It's basically cooked chicken, rice, soy sauce, and shredded egg stir-fried together. For best results, use leftover cooked rice.",
    "ingredients": "1 large egg|1 tablespoon water|1 tablespoon butter|1 tablespoon vegetable oil|1 onion, chopped|2 cups cooked white rice, cold|1 cup cooked, chopped chicken meat|2 tablespoons soy sauce|1 teaspoon ground black pepper",
    "rating": 4,
    "instructions": "Gather all ingredients.|Beat egg and water together in small bowl. Melt butter in a large skillet or wok over medium-low heat; add egg and cook without stirring, 1 to 2 minutes. Remove egg from skillet and cut into shreds; set aside.|Heat oil in the same skillet. Add onion; cook and stir until soft, about 3 minutes. Stir in rice, chicken, soy sauce, and pepper. Cook and stir for about 5 minutes; stir in shredded egg. Serve hot.",
    "notes": "This chicken fried rice recipe is very easy and tasty! It's basically cooked chicken, rice, soy sauce, and shredded egg stir-fried together. For best results, use leftover cooked rice."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/spicy_szechuan_green_beans.jpg",
    "recipeName": "Spicy Szechuan Green Beans",
    "description": "These Szechuan green beans taste wonderful and are almost as good as takeout Chinese green beans! Their spicy flavor is wonderful with ham and a baked yam.",
    "ingredients": "½ pound green beans, trimmed and cut into 1-inch pieces|¼ cup water|1 tablespoon minced ginger|2 cloves garlic, minced|1 teaspoon sesame oil|2 tablespoons soy sauce|1 tablespoon rice vinegar|½ teaspoon white sugar|¼ teaspoon red pepper flakes",
    "rating": 4,
    "instructions": "Combine green beans and water in a skillet over medium-high heat. Cover and cook, stirring occasionally, until beans are tender-crisp, 4 to 5 minutes. Add ginger, garlic, and sesame oil; cook, stirring frequently, until garlic is fragrant and golden brown, 1 to 2 minutes.|Mix soy sauce, rice vinegar, sugar, and red pepper flakes together in a small bowl. Pour over beans and cook until sauce thickens enough to coat beans, 3 to 5 minutes.",
    "notes": "These Szechuan green beans taste wonderful and are almost as good as takeout Chinese green beans! Their spicy flavor is wonderful with ham and a baked yam."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/quick_chinese-style_vermicelli_(rice_noodles).jpg",
    "recipeName": "Quick Chinese-Style Vermicelli (Rice Noodles)",
    "description": "These Chinese-style rice vermicelli noodles make a quick and delicious meal.",
    "ingredients": "1 (8 ounce) package dried rice noodles|2 tablespoons vegetable oil|1 clove garlic, minced|1 tablespoon soy sauce|½ tablespoon chili sauce|salt and pepper to taste|1 green onion, chopped",
    "rating": 4,
    "instructions": "Fill a large pot with water and bring to a rolling boil; stir in rice noodles and return to a boil. Cook until al dente, 2 to 3 minutes; try not to overcook as they will become mushy. Drain.|Heat oil in a large skillet over medium heat. Add garlic and sauté until tender. Stir in noodles; season with soy sauce, chili sauce, salt, and pepper. Sprinkle with chopped green onion.",
    "notes": "These Chinese-style rice vermicelli noodles make a quick and delicious meal."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/daddy's_shrimp_toast.jpg",
    "recipeName": "Daddy's Shrimp Toast",
    "description": "My father came up with this easy shrimp toast recipe while experimenting in the kitchen. It's an absolutely delicious way to use shrimp. I think I've gotten pretty good at making this dish, but it still doesn't compare to my father's! Don't be fooled by the ingredients — most are optional. Serve as an appetizer or main dish.",
    "ingredients": "1 pound fresh shrimp, peeled, deveined and finely minced|½ medium yellow onion, minced|½ cup finely chopped water chestnuts (Optional)|½ cup finely chopped celery (Optional)|1 green onion, finely chopped|½ cup cooked crabmeat|1 large egg, beaten|1 ½ tablespoons chopped fresh parsley|1 teaspoon sesame oil|1 teaspoon minced garlic|5 drops soy sauce|salt and ground black pepper to taste|¼ cup soy sauce|3 tablespoons chopped fresh parsley|1 tablespoon water|1 teaspoon sesame oil|1 teaspoon white sugar|¼ teaspoon garlic powder, or to taste|2 cups oil for frying|8 thick slices white bread",
    "rating": 4,
    "instructions": "Gather all ingredients.|Make the shrimp paste: Mix shrimp, onion, water chestnuts, celery, and green onion together in a mixing bowl. Stir in crabmeat, egg, parsley, sesame oil, garlic, soy sauce, salt, and pepper.|Make the dipping sauce: Whisk soy sauce, parsley, water, sesame oil, sugar, and garlic powder together in a small bowl.|Make the toast: Heat 1/2 inch oil in a large, heavy skillet over medium heat.|Spread each slice bread with a thick layer of shrimp paste, pressing gently so it sticks to bread.|Working in batches, fry bread, paste-side down, in hot oil until golden and shrimp is pink, 2 to 3 minutes. Flip carefully and cook until bread is golden brown, about 1 minute. Drain on paper towels.|Slice shrimp toasts diagonally and serve with dipping sauce.",
    "notes": "My father came up with this easy shrimp toast recipe while experimenting in the kitchen. It's an absolutely delicious way to use shrimp. I think I've gotten pretty good at making this dish, but it still doesn't compare to my father's! Don't be fooled by the ingredients — most are optional. Serve as an appetizer or main dish."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_chicken_fried_rice.jpg",
    "recipeName": "Chinese Chicken Fried Rice",
    "description": "This chicken fried rice recipe tastes just like what they serve in restaurants. A stir-fry with chicken, rice, soy sauce, and veggies like peas, carrots, celery, and bell peppers. My sister just sort of whipped this up one day, and it's very good!",
    "ingredients": "½ tablespoon sesame oil|1 onion, diced|1 ½ pounds cooked, cubed chicken meat|2 tablespoons soy sauce|2 large carrots, diced|2 stalks celery, diced|1 large red bell pepper, diced|¾ cup fresh pea pods, halved|½ large green bell pepper, diced|6 cups cooked white rice|2 large eggs, scrambled|⅓ cup soy sauce",
    "rating": 4,
    "instructions": "Heat sesame oil in a large skillet over medium heat. Add onion and sauté until soft. Add cooked chicken and 2 tablespoons soy sauce; stir-fry for 5 to 6 minutes.|Stir in carrots, celery, red bell pepper, pea pods, and green bell pepper; stir-fry for 5 minutes. Mix in cooked rice until thoroughly combined.|Stir in scrambled eggs and 1/3 cup soy sauce; cook until heated through and serve hot.",
    "notes": "This chicken fried rice recipe tastes just like what they serve in restaurants. A stir-fry with chicken, rice, soy sauce, and veggies like peas, carrots, celery, and bell peppers. My sister just sort of whipped this up one day, and it's very good!"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/bang_bang_chicken.jpg",
    "recipeName": "Bang Bang Chicken",
    "description": "This bang bang chicken is a wonderful Americanized version of an extremely popular Sichuan Chinese dish. With twice-fried chicken, you get the crispy fried breading you'd expect, and the bang bang sauce drizzle makes the entire dish spectacular. You'll love this more than any restaurant version. Pay attention to the notes in the directions.",
    "ingredients": "⅓ cup milk|1 large egg|1 pound boneless, skinless chicken breasts, cut into 1-inch cubes|¼ cup potato starch|¼ cup all-purpose flour|½ teaspoon salt|¼ teaspoon ground black pepper|¼ teaspoon shichimi togarashi (Japanese red pepper condiment)|2 cups oil for frying, or as needed|¼ cup mayonnaise|2 tablespoons honey|2 tablespoons sweet chili sauce|1 teaspoon gochujang (Korean hot pepper paste)",
    "rating": 3,
    "instructions": "Whisk together milk and egg in a large bowl until well combined. Add chicken; stir to coat and allow to marinate for 15 minutes. Drain and discard egg mixture.|Combine potato starch, flour, salt, pepper, and shichimi in a medium bowl. Pour into a large plastic resealable bag. Add chicken; seal the bag and shake until chicken is well coated.|Heat 2 inches oil in a deep saucepan over medium heat to 325 degrees F (165 degrees C).|Working in batches of about 5 to 8 pieces at a time, cook chicken in hot oil for about 90 seconds. Remove to a paper towel-lined plate; keep each batch separate.|Increase oil temperature to 350 degrees F (175 degrees C). The oil should be continuously boiling at this point. Carefully re-add the first batch of chicken and fry for another 90 seconds. Remove to another paper towel-lined plate. Repeat with remaining batches of chicken.|Mix together mayonnaise, honey, sweet chili sauce, and gochujang in a large serving bowl until combined. Toss fried chicken with sauce to coat.DIANA71",
    "notes": "This bang bang chicken is a wonderful Americanized version of an extremely popular Sichuan Chinese dish. With twice-fried chicken, you get the crispy fried breading you'd expect, and the bang bang sauce drizzle makes the entire dish spectacular. You'll love this more than any restaurant version. Pay attention to the notes in the directions."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/shrimp_with_lobster_sauce.jpg",
    "recipeName": "Shrimp with Lobster Sauce",
    "description": "This shrimp with lobster sauce is just like what you'd find at a Chinese restaurant that serves Cantonese cuisine. Despite the name, there's no lobster in the sauce. Serve over white rice.",
    "ingredients": "1 ½ teaspoons cornstarch|2 teaspoons cooking sherry|1 pound medium shrimp - peeled and deveined|¼ cup vegetable oil|2 cloves garlic, minced|¼ pound ground pork|1 cup water|2 tablespoons soy sauce|¼ teaspoon sugar|½ teaspoon salt|¼ cup cold water|1 ½ tablespoons cornstarch|1 large egg, beaten",
    "rating": 5,
    "instructions": "Dissolve 1 1/2 teaspoons cornstarch in sherry in a medium bowl. Add shrimp and toss to coat.|Heat oil in a wok over medium-high heat. Add shrimp and stir-fry until pink, 3 to 5 minutes. Use a slotted spoon to transfer shrimp to a plate; leave as much oil in the wok as possible.|Add garlic to the wok and stir-fry for a few seconds, then add ground pork. Stir-fry until pork is no longer pink, 3 to 5 minutes.|Mix 1 cup water, soy sauce, sugar, and salt together in a small bowl; pour into the wok and stir to combine. Bring to a boil, then cover, reduce the heat to medium, and simmer for about 2 minutes.|Whisk 1/4 cup cold water and 1 1/2 tablespoons cornstarch together in a small bowl; pour into the wok. Add shrimp and bring to a simmer. Drizzle beaten egg into the wok, stirring quickly as it cooks. Serve immediately.",
    "notes": "This shrimp with lobster sauce is just like what you'd find at a Chinese restaurant that serves Cantonese cuisine. Despite the name, there's no lobster in the sauce. Serve over white rice."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/pork_lo_mein.jpg",
    "recipeName": "Pork Lo Mein",
    "description": "This pork lo mein recipe was inspired by another recipe, but I added more vegetables, ginger, and sesame oil. Add or remove veggies as you see fit.",
    "ingredients": "1 (8 ounce) package linguine|⅓ cup low-sodium soy sauce|2 tablespoons rice vinegar|2 teaspoons cornstarch|1 teaspoon white sugar|½ teaspoon sesame oil|2 tablespoons canola oil|2 cups snap peas|1 small sweet onion, chopped|1 (12 ounce) pork tenderloin, cut into thin strips|1 (8 ounce) package sliced white mushrooms|1 medium red bell pepper, chopped|3 cloves garlic, chopped, divided|½ teaspoon chopped fresh ginger, or to taste|3 green onions, sliced",
    "rating": 4,
    "instructions": "Bring a large pot of lightly salted water to a boil; cook the linguine at a boil until tender yet firm to the bite, 8 to 9 minutes; drain.|Meanwhile, whisk soy sauce, vinegar, cornstarch, sugar, and sesame oil together in a small bowl.|Heat canola oil in a large skillet over medium-high heat. Add snap peas and onion; cook and stir until onion is translucent, about 2 minutes. Add pork, mushrooms, red bell pepper, 1/3 of the garlic, and ginger; cook until pork is no longer pink, about 2 minutes.|Add remaining garlic to the skillet and cook until fragrant, about 1 minute. Pour in soy sauce mixture; cook and stir until sauce thickens, about 1 minute. Remove from the heat.|Stir linguine into the skillet until coated; sprinkle green onions over top.",
    "notes": "This pork lo mein recipe was inspired by another recipe, but I added more vegetables, ginger, and sesame oil. Add or remove veggies as you see fit."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/moo_goo_gai_pan.jpg",
    "recipeName": "Moo Goo Gai Pan",
    "description": "Moo goo gai pan is a Chinese-American dish that literally translates to chicken with sliced mushrooms. This dish is great, light, and very flavorful.",
    "ingredients": "2 tablespoons vegetable oil, divided|2 cups chopped broccoli florets|1 cup sliced fresh mushrooms|1 (15 ounce) can whole straw mushrooms, drained|1 (8 ounce) can sliced bamboo shoots, drained|1 (8 ounce) can sliced water chestnuts, drained|2 cloves garlic, minced|1 pound skinless, boneless chicken breast, cut into strips|¼ cup chicken broth|1 tablespoon cornstarch|1 tablespoon white sugar|1 tablespoon soy sauce|1 tablespoon oyster sauce|1 tablespoon rice wine",
    "rating": 4,
    "instructions": "Heat 1 tablespoon oil in a wok over high heat until it begins to smoke. Stir in broccoli and fresh mushrooms, then add straw mushrooms, bamboo shoots, and water chestnuts. Stir-fry until broccoli is tender and all vegetables are hot, about 5 minutes. Transfer to a bowl and wipe out the wok.|Heat remaining 1 tablespoon oil in the wok over high heat until it begins to smoke. Add garlic and stir-fry until it turns golden, a few seconds. Add chicken and stir-fry until browned on the edges and no longer pink in the center, about 5 minutes.|Stir broth, cornstarch, sugar, soy sauce, oyster sauce, and rice wine together in a small bowl; pour over chicken in the wok and bring to a boil, stirring constantly. Boil until sauce thickens and is no longer cloudy, about 30 seconds. Return vegetables to the wok; toss with sauce and cook until heated through, about 1 minute.",
    "notes": "Moo goo gai pan is a Chinese-American dish that literally translates to chicken with sliced mushrooms. This dish is great, light, and very flavorful."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/szechwan_shrimp.jpg",
    "recipeName": "Szechwan Shrimp",
    "description": "Szechuan shrimp is an impressive dish made with simple ingredients. I usually make it for company. For more or less heat, adjust the amount of red pepper. Serve over hot steamed rice.",
    "ingredients": "4 tablespoons water|2 tablespoons ketchup|1 tablespoon soy sauce|2 teaspoons cornstarch|1 teaspoon honey|½ teaspoon crushed red pepper|¼ teaspoon ground ginger|1 tablespoon vegetable oil|¼ cup sliced green onions|4 cloves garlic, minced|12 ounces cooked shrimp, tails removed",
    "rating": 4,
    "instructions": "Stir together water, ketchup, soy sauce, cornstarch, honey, crushed red pepper, and ground ginger in a small bowl until combined. Set aside.|Heat oil in a large skillet over medium-high heat. Cook and stir green onions and garlic in hot oil until fragrant, about 30 seconds. Stir in cooked shrimp; toss to coat with oil. Pour in ketchup mixture. Cook and stir until sauce is bubbly and thickened.JOY FLOWERS BEST",
    "notes": "Szechuan shrimp is an impressive dish made with simple ingredients. I usually make it for company. For more or less heat, adjust the amount of red pepper. Serve over hot steamed rice."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_broccoli.jpg",
    "recipeName": "Chinese Broccoli",
    "description": "Chinese broccoli is my favorite veggie. This recipe combines this wonderful creation with Asian flavors for a delicious side.",
    "ingredients": "1 bunch gai lan (Chinese broccoli), trimmed|3 tablespoons hoisin sauce|2 tablespoons white sugar|2 tablespoons soy sauce|1 tablespoon cornstarch|1 tablespoon rice vinegar|1 tablespoon sesame oil|2 cloves garlic, minced|1 teaspoon minced fresh ginger root or to taste",
    "rating": 5,
    "instructions": "Bring a large pot of lightly salted water to a boil. Cook Chinese broccoli in boiling water, uncovered, until just tender, about 4 minutes. Drain and place in a shallow bowl.|Whisk together hoisin sauce, sugar, soy sauce, cornstarch, rice vinegar, sesame oil, garlic, and ginger in a small saucepan over medium heat until sauce is thickened and no longer cloudy, 5 to 7 minutes. Pour sauce over broccoli; toss to coat and serve.",
    "notes": "Chinese broccoli is my favorite veggie. This recipe combines this wonderful creation with Asian flavors for a delicious side."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/taiwanese_popcorn_chicken.jpg",
    "recipeName": "Taiwanese Popcorn Chicken",
    "description": "These Taiwanese popcorn chicken bites are incredibly delicious. Five-spice, ginger, and soy sauce flavor bite-sized pieces of chicken before they're dipped in tempura mix and fried until golden and crispy.",
    "ingredients": "1 ½ pounds boneless chicken thighs, cut into bite-size pieces|2 cloves garlic, finely chopped|1 tablespoon soy sauce|2 teaspoons grated ginger|1 teaspoon five-spice powder|1 teaspoon ground white pepper, or to taste|1 teaspoon salt, or to taste|½ teaspoon rice vinegar|½ teaspoon cayenne pepper|1 large egg|1 cup tempura batter mix, dry, or as needed|2 cups peanut oil for frying, or as needed|1 bunch Thai basil, chopped|2 green onions, chopped",
    "rating": 5,
    "instructions": "Mix chicken, garlic, soy sauce, ginger, five-spice powder, white pepper, salt, vinegar, and cayenne pepper together in a large bowl until well combined. Let marinate for 10 minutes.|Heat oil in a deep-fryer or large saucepan to 400 degrees F (200 degrees C).|Whisk egg in a small bowl until smooth. Place dry tempura mix into a second small bowl. Dip chicken pieces one at a time into egg, then dredge in tempura mix, shaking off any excess.|Working in batches, lower chicken carefully into hot oil and fry until golden brown, 5 to 8 minutes. Transfer to a paper towel-lined plate to drain and season with salt and pepper.|Transfer chicken to a platter and garnish with basil leaves and green onions.",
    "notes": "These Taiwanese popcorn chicken bites are incredibly delicious. Five-spice, ginger, and soy sauce flavor bite-sized pieces of chicken before they're dipped in tempura mix and fried until golden and crispy."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/crispy_orange_beef.jpg",
    "recipeName": "Crispy Orange Beef",
    "description": "A delicious orange beef recipe that is crispy and sweet yet mildly spiced. This beef stir-fry recipe is great served with steamed rice and broccoli.",
    "ingredients": "1 ½ pounds beef top sirloin, thinly sliced|2 cups water|1 cup long grain rice|⅓ cup white sugar|⅓ cup rice wine vinegar|2 tablespoons frozen orange juice concentrate|1 tablespoon soy sauce|1 teaspoon salt|2 cups oil for frying|¼ cup cornstarch|3 tablespoons grated fresh ginger|1 ½ tablespoons minced garlic|2 teaspoons orange zest|8 broccoli florets, lightly steamed or blanched",
    "rating": 3,
    "instructions": "Lay beef in a single layer on a baking sheet lined with paper towels. Allow to dry in the refrigerator for 30 minutes.|Meanwhile, bring water and rice to a boil in a medium saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender, about 20 minutes.|Mix together sugar, rice vinegar, orange juice concentrate, soy sauce, and salt in a small bowl. Set aside.|Heat oil in a wok over medium-high heat. Toss dried beef in cornstarch to coat. Fry coated beef in hot oil in small batches until crispy and golden brown; set aside. Drain oil from the wok, leaving about 1 tablespoon.|Add ginger, garlic, and orange zest to remaining oil in wok. Cook and stir briefly until fragrant. Pour in soy sauce mixture; bring to a boil and cook until thick and syrupy, about 5 minutes. Stir in fried beef and cook until heated through. Serve hot over steamed rice and garnish with broccoli.",
    "notes": "A delicious orange beef recipe that is crispy and sweet yet mildly spiced. This beef stir-fry recipe is great served with steamed rice and broccoli."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/szechuan_beef.jpg",
    "recipeName": "Szechuan Beef",
    "description": "This Szechuan beef is spicy! Serve with rice.",
    "ingredients": "1 tablespoon soy sauce|2 teaspoons cornstarch|1 clove garlic, minced|¼ teaspoon crushed red pepper|1 pound sirloin steak, cut into bite-sized strips|2 tablespoons vegetable oil|3 cups fresh broccoli florets|2 small onions, cut into wedges|1 (8 ounce) can water chestnuts, drained|¼ cup chicken broth|½ cup peanuts",
    "rating": 4,
    "instructions": "Stir together soy sauce, cornstarch, garlic, and crushed red pepper in a non-metal bowl. Add steak and toss to coat. Cover the bowl and refrigerate for 20 minutes.|Heat oil in a wok or large skillet over high heat. Stir-fry beef in hot oil until no longer pink, about 5 minutes. Add broccoli, onions, and water chestnuts; cook and stir for 2 minutes. Pour in broth and bring to a boil. Stir in peanuts; cook for 1 minute and serve hot.",
    "notes": "This Szechuan beef is spicy! Serve with rice."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/super-simple,_super-spicy_mongolian_beef.jpg",
    "recipeName": "Super-Simple, Super-Spicy Mongolian Beef",
    "description": "This spicy Mongolian beef is a great-tasting recipe that is easy to prepare and takes minutes to cook! Serve with rice and a veggie side for a nice family dinner.",
    "ingredients": "¼ cup soy sauce|1 tablespoon hoisin sauce|1 tablespoon sesame oil|2 teaspoons white sugar|1 tablespoon minced garlic|1 tablespoon red pepper flakes (Optional)|1 pound beef flank steak, thinly sliced|1 tablespoon peanut oil|2 large green onions, thinly sliced",
    "rating": 4,
    "instructions": "Whisk together soy sauce, hoisin sauce, sesame oil, sugar, garlic, and red pepper flakes in a large bowl. Toss beef with marinade; cover the bowl and refrigerate for 1 hour to overnight.|Heat peanut oil in a wok or large, nonstick skillet over high heat. Cook and stir green onions in hot oil for 5 to 10 seconds. Remove beef from marinade and add to green onions in the wok; discard marinade. Cook and stir until beef is no longer pink and begins to brown, about 5 minutes.",
    "notes": "This spicy Mongolian beef is a great-tasting recipe that is easy to prepare and takes minutes to cook! Serve with rice and a veggie side for a nice family dinner."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/broccoli_and_carrot_stir_fry.jpg",
    "recipeName": "Broccoli and Carrot Stir Fry",
    "description": "A simple and healthy side dish that will go well with any meal. It's also quick and easy to make! Broccoli, carrots, and seasonings are stir-fried to perfection.",
    "ingredients": "5 ½ cups broccoli florets|1 carrot, thinly sliced|2 teaspoons water|1 teaspoon cornstarch|1 teaspoon chicken bouillon granules, or to taste|salt to taste|2 tablespoons peanut oil",
    "rating": 3,
    "instructions": "Bring a large pot of lightly salted water to a boil. Add broccoli and cook uncovered until bright green, about 2 minutes. Transfer broccoli to a bowl of ice water using a slotted spoon and immerse for several minutes to stop the cooking process. Drain.|Bring water back to a boil in the same large pot; add sliced carrot and cook for 1 minute. Drain.|Mix water and cornstarch together in a bowl until smooth. Add chicken granules and salt and mix well.|Heat peanut oil in a wok or large skillet over high heat; saute broccoli and carrots for 2 minutes. Add cornstarch mixture; cook and stir until vegetables are coated evenly, 1 to 2 minutes.",
    "notes": "A simple and healthy side dish that will go well with any meal. It's also quick and easy to make! Broccoli, carrots, and seasonings are stir-fried to perfection."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/green_onion_cakes.jpg",
    "recipeName": "Green Onion Cakes",
    "description": "An excellent and simple recipe, these will make some delicious green onion cakes that are addictive and are just as good, if not better, than the store bought ones.",
    "ingredients": "3 cups bread flour|1 ¼ cups boiling water|2 tablespoons vegetable oil|salt and pepper to taste|1 bunch green onions, finely chopped|2 teaspoons vegetable oil, or as needed",
    "rating": 5,
    "instructions": "Use a fork to mix flour and boiling water in a large bowl. Knead dough into a ball. Cover bowl with plastic wrap; let dough rest for 30 to 60 minutes.|Evenly divide dough into 16 pieces. Roll each piece into a 1/4 inch thick circle. Brush each circle with oil, season with salt and pepper, and sprinkle with about 1 teaspoon of green onions. Roll up, cigar style; coil each pancake and pinch open ends together to form a disc. Roll each circle flat to about 1/4 inch thickness.|Heat 2 teaspoons oil in a large skillet. Fry cakes until golden brown, about 2 minutes on each side. Add more oil between batches, if necessary.",
    "notes": "An excellent and simple recipe, these will make some delicious green onion cakes that are addictive and are just as good, if not better, than the store bought ones."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_eggplant_with_garlic_sauce.jpg",
    "recipeName": "Chinese Eggplant with Garlic Sauce",
    "description": "This recipe uses Chinese eggplants which are skinnier, longer, and are a lighter purple color. They are also a bit denser and hold up better when cooked. This dish is mildly spicy (or you can make it very spicy, if you like). My mother has been making this for me since I was a child. It is so good!",
    "ingredients": "3 tablespoons canola oil|4 Chinese eggplants, halved lengthwise and cut into 1 inch half moons|1 cup water|3 tablespoons garlic powder, or to taste|1 tablespoon crushed red pepper flakes, or to taste|2 tablespoons light soy sauce|2 tablespoons oyster sauce|5 teaspoons white sugar, or to taste|1 teaspoon cornstarch",
    "rating": 5,
    "instructions": "Heat oil in a large skillet over high heat. Cook and stir eggplant in hot oil until soft, about 4 minutes. Stir in water, garlic powder, and red pepper flakes. Cover and simmer until water is absorbed.|Meanwhile, mix together soy sauce, oyster sauce, sugar, and cornstarch in a small bowl until sugar and cornstarch are dissolved.|Stir sauce into eggplant until evenly coated. Continue cooking until sauce is thickened.",
    "notes": "This recipe uses Chinese eggplants which are skinnier, longer, and are a lighter purple color. They are also a bit denser and hold up better when cooked. This dish is mildly spicy (or you can make it very spicy, if you like). My mother has been making this for me since I was a child. It is so good!"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_barbeque_pork_(char_siu).jpg",
    "recipeName": "Chinese Barbeque Pork (Char Siu)",
    "description": "In addition to its impressive high-gloss appearance and savory taste, this Chinese barbeque pork is quite easy to make at home — even without a fancy ceramic grill.",
    "ingredients": "⅔ cup soy sauce|½ cup honey|½ cup Chinese rice wine (or sake or dry sherry)|⅓ cup hoisin sauce|⅓ cup ketchup|⅓ cup brown sugar|4 cloves garlic, crushed|1 teaspoon Chinese five-spice powder|½ teaspoon freshly ground black pepper|¼ teaspoon cayenne pepper|⅛ teaspoon pink curing salt (Optional)|1 (3 pound) boneless pork butt (shoulder)|1 teaspoon red food coloring, or as desired (Optional)|1 teaspoon kosher salt, or to taste",
    "rating": 3,
    "instructions": "Place soy sauce, honey, rice wine, hoisin sauce, ketchup, brown sugar, garlic, five-spice powder, black pepper, cayenne pepper, and curing salt in a saucepan. Bring to a boil on high heat; reduce heat to medium-high. Cook for 1 minute. Remove from heat. Cool to room temperature.|Cut pork roast in half lengthwise. Cut each half again lengthwise forming 4 long, thick pieces of pork.|Transfer cooled sauce to a large mixing bowl. Stir in red food coloring. Place pork sections into sauce and coat each piece. Cover with plastic wrap and refrigerate 4 to 12 hours.|Preheat grill for medium heat, 275 to 300 degrees F (135 to 150 degrees C) and lightly oil the grate. Line a baking sheet with parchment paper.|Remove sections of pork from marinade and let excess drip off. Place on prepared baking sheet. Sprinkle with kosher salt to taste.|Transfer pork sections to grate over indirect heat on the prepared grill. Cover and cook for about 45 minutes. Brush with marinade; turn. Continue cooking until an instant-read thermometer inserted into the center reads at least 145 degrees F (63 degrees C), about 1 hour and 15 minutes more. Do not use any more marinade on cooked meat until after you boil it.|Place leftover marinade in a saucepan; bring to a boil; let simmer for 1 minute. Remove from heat. Now you can use it to brush over the cooked pork.CHEF JOHN",
    "notes": "In addition to its impressive high-gloss appearance and savory taste, this Chinese barbeque pork is quite easy to make at home — even without a fancy ceramic grill."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/sweet_and_sour_pork_tenderloin.jpg",
    "recipeName": "Sweet and Sour Pork Tenderloin",
    "description": "I thoroughly enjoyed this plate of florescent food, and if you're a fan of the Chinese take-out version, I believe you will enjoy this too.",
    "ingredients": "1 (1 1/4 pound) pork tenderloin, trimmed of silver skin|salt and ground black pepper|⅓ cup ketchup|⅓ cup seasoned rice vinegar|1 (8 ounce) can pineapple chunks, drained with juice reserved|2 tablespoons brown sugar|4 cloves garlic, minced|2 teaspoons hot chili sauce (such as Sriracha®)|1 teaspoon soy sauce|1 pinch red pepper flakes|1 tablespoon vegetable oil|1 teaspoon butter|¼ cup chopped green onion (white part only)|2 tablespoons chopped green onion tops",
    "rating": 4,
    "instructions": "Cut tenderloin into 4 pieces. Arrange in a single layer between two sheets of plastic wrap and pound with a meat mallet until each is about 1-inch thick. Generously season with salt and black pepper.|Whisk ketchup, rice vinegar, reserved pineapple juice, brown sugar, garlic, hot chili sauce, soy sauce, and red pepper flakes in a bowl. Set aside.|Heat vegetable oil in a skillet over high heat. Place pork in pan; reduce heat to medium. Cook until browned on both sides and cooked through, 5 to 6 minutes per side. Transfer to a plate.|Return skillet to medium heat. Stir butter into hot pan. When butter melts and starts to brown, stir in pineapple chunks. Cook, stirring, until pineapple is golden brown, 3 to 4 minutes.|Stir in ketchup mixture and 1/4 cup green onion (white parts). Reduce heat to low and simmer until garlic and onion have softened, 5 minutes.|Return pork to skillet; cook, stirring, until pork is heated through. Garnish with 2 tablespoons green onion tops.ERIN MARIE",
    "notes": "I thoroughly enjoyed this plate of florescent food, and if you're a fan of the Chinese take-out version, I believe you will enjoy this too."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/hong_kong_style_egg_tarts.jpg",
    "recipeName": "Hong Kong Style Egg Tarts",
    "description": "Very easy to make Chinese style Egg Tart, you can put the leftovers in the refrigerator for later use for up to 3 days. You can reduce the sugar used on the crust and the filling to fit your taste, this recipe is lightly sweetened. If you want to you, can add more sugar to the filling. Hope you enjoy it!",
    "ingredients": "1 cup confectioners' sugar|3 cups all-purpose flour|1 cup butter|1 egg, beaten|1 dash vanilla extract|⅔ cup white sugar|1 ½ cups water|9 eggs, beaten|1 dash vanilla extract|1 cup evaporated milk",
    "rating": 4,
    "instructions": "In a medium bowl, mix together the confectioners' sugar and flour. Mix in butter with a fork until it is in small crumbs. Stir in the egg and vanilla until the mixture forms a dough. The texture should be slightly moist. Add more butter if it is too dry, or more flour, if the dough seems greasy. Shape dough into 1 1/2 inch balls, and press the balls into tart molds so that it covers the bottom, and goes up higher than the sides. Use 2 fingers to shape the edge into an A shape.|Preheat the oven to 450 degrees F (230 degrees C). Combine the white sugar and water in a medium saucepan, and bring to a boil. Cook until the sugar is dissolved, remove from heat and cool to room temperature. Strain the eggs through a sieve, and whisk into the sugar mixture. Stir in the evaporated milk and vanilla. Strain the filling through a sieve, and fill the tart shells.|Bake for 15 to 20 minutes in the preheated oven, until golden brown, and the filling is puffed up a little bit.",
    "notes": "Very easy to make Chinese style Egg Tart, you can put the leftovers in the refrigerator for later use for up to 3 days. You can reduce the sugar used on the crust and the filling to fit your taste, this recipe is lightly sweetened. If you want to you, can add more sugar to the filling. Hope you enjoy it!"
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/easy_fried_chinese_chicken_balls.jpg",
    "recipeName": "Easy Fried Chinese Chicken Balls",
    "description": "These fried Chinese chicken pieces are crispy, succulent, and hard to stop eating! They're so good that they will give your local Chinese restaurant a run for their money. Enjoy with rice and sweet and sour sauce.",
    "ingredients": "1 cup all-purpose flour|2 teaspoons baking powder|1 pinch salt|1 teaspoon sesame oil|½ cup water, or more if needed|vegetable oil for frying|5 tablespoons cornstarch|1 pinch ground white pepper|4 boneless skinless chicken breasts, cubed",
    "rating": 4,
    "instructions": "Make batter: Combine flour, baking powder, and salt in a large bowl. Drizzle in sesame oil. Gradually add water, whisking constantly until smooth; batter should be the consistency of cream. Let sit for at least 30 minutes.|Fill a deep pan or wok with oil and slowly heat to 375 degrees F (190 degrees C).|Prepare chicken: Mix together cornstarch and white pepper in a large shallow dish. Dust chicken in cornstarch mixture, then dip into batter, evenly coating each piece.|Working in batches, fry coated chicken in hot oil until golden and no longer pink in the center, 4 to 5 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).Use a slotted spoon to remove fried chicken to a clean kitchen towel to drain.",
    "notes": "These fried Chinese chicken pieces are crispy, succulent, and hard to stop eating! They're so good that they will give your local Chinese restaurant a run for their money. Enjoy with rice and sweet and sour sauce."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/chinese_green_bean_stir-fry.jpg",
    "recipeName": "Chinese Green Bean Stir-Fry",
    "description": "Asian-style green beans with lots of flavor! This recipe is made for a large party; but can be scaled down for a family dinner. Serve cold or warm.",
    "ingredients": "1 cup vegetable oil|13 pounds fresh green beans, trimmed|5 tablespoons minced garlic|5 tablespoons minced fresh ginger root|2 tablespoons kosher salt|1 tablespoon coarsely ground black pepper|2 (8 ounce) bottles black bean sauce",
    "rating": 4,
    "instructions": "In a large wok, heat oil over medium-high heat. Stir in green beans; cook, stirring frequently, for 1 to 2 minutes. Stir in garlic and ginger; cook, stirring frequently, for 3 to 4 minutes. Season with salt and pepper, and then stir in black bean sauce. Continue cooking until green beans are tender.",
    "notes": "Asian-style green beans with lots of flavor! This recipe is made for a large party; but can be scaled down for a family dinner. Serve cold or warm."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/beef_with_vegetables.jpg",
    "recipeName": "Beef with Vegetables",
    "description": "Simple and delicious beef with mixed vegetables. You don't have to stick with these vegetables. Change them to your personal taste. Try serving over rice or noodles.",
    "ingredients": "8 ounces beef filet, cut into 1/2 inch strips|2 tablespoons vegetable oil|1 onion, chopped|1 clove garlic, minced|1 teaspoon chopped fresh ginger root|1 green bell pepper, chopped|1 carrot, chopped|1 (10.5 ounce) can beef broth|1 tablespoon cornstarch|1 teaspoon white sugar|1 tablespoon soy sauce|1 tablespoon oyster sauce|salt and pepper to taste",
    "rating": 4,
    "instructions": "In a large skillet over medium high heat, saute the beef slices in the oil for 5 minutes, or until well browned. Add the onion, garlic and ginger and saute for 5 more minutes. Then add the green bell pepper, carrot and beef broth. Reduce heat to low and let simmer.|Meanwhile, in a separate small bowl, combine the corn flour, sugar, soy sauce and oyster sauce, if desired. Stir thoroughly, forming a smooth paste. Slowly add this to the simmering beef and vegetables, stirring well, and let simmer to desired thickness. Season with salt and pepper to taste.",
    "notes": "Simple and delicious beef with mixed vegetables. You don't have to stick with these vegetables. Change them to your personal taste. Try serving over rice or noodles."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/slow_cooker_mongolian_beef.jpg",
    "recipeName": "Slow Cooker Mongolian Beef",
    "description": "I got this recipe from a friend and it is wonderful. My kids love it. It tastes like you got it at a Chinese restaurant and the slow cooker does most of the work! Serve over steamed rice.",
    "ingredients": "1 pound flank steak, cut into bite-size pieces|¼ cup cornstarch|2 teaspoons olive oil|1 onion, thinly sliced|1 tablespoon minced garlic|3 large green onions, sliced diagonally into 1/2 inch pieces|½ cup soy sauce|½ cup water|½ cup brown sugar|½ teaspoon minced fresh ginger root|½ cup hoisin sauce",
    "rating": 4,
    "instructions": "Place flank steak and cornstarch into a resealable plastic bag. Shake the bag to evenly coat the flank steak with the cornstarch. Allow to steak rest for 10 minutes.|Heat olive oil in a large skillet over medium-high heat. Cook and stir steak until evenly browned, 2 to 4 minutes. Place onion, garlic, flank steak, green onions, soy sauce, water, brown sugar, ginger, and hoisin sauce in a slow cooker. Cook on Low setting for about 4 hours.",
    "notes": "I got this recipe from a friend and it is wonderful. My kids love it. It tastes like you got it at a Chinese restaurant and the slow cooker does most of the work! Serve over steamed rice."
  },
  {
    "image": "/Users/leoli/Desktop/leo-projects/Recipe-Book/scripts/recipe_images/black_pepper_beef_and_cabbage_stir_fry.jpg",
    "recipeName": "Black Pepper Beef and Cabbage Stir Fry",
    "description": "A very simple Chinese stir-fry dish which is fabulous in taste. I saw my husband going for two additional servings of it and I had to remind him to leave some for the rest of the family! Serve with hot steamed rice.",
    "ingredients": "2 tablespoons vegetable oil|4 cloves garlic, chopped|½ pound ground beef|½ small head cabbage, shredded|1 red bell pepper, cut into strips|2 tablespoons soy sauce|1 teaspoon cornstarch|½ cup cold water|1 teaspoon ground black pepper, or to taste|1 pinch salt, to taste",
    "rating": 4,
    "instructions": "Gather ingredients.|Heat a wok or large skillet over medium-high heat, and add oil. Saute garlic for about 5 seconds, then add ground beef. Stir-fry until beef is evenly brown, 5 to 7 minutes; drain excess fat.|Stir in cabbage and pepper, and cook until vegetables are tender and beef is fully cooked. Stir in soy sauce.|Mix together cornstarch and water, and stir in. Season with pepper; add salt to taste. Cook, stirring, until sauce has thickened.|Serve hot and enjoy!",
    "notes": "A very simple Chinese stir-fry dish which is fabulous in taste. I saw my husband going for two additional servings of it and I had to remind him to leave some for the rest of the family! Serve with hot steamed rice."
  }
]
